iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res21[4084];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI4_READ_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AW_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI4_WRITE_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI4_FN_MOD;

  uint8_t res22[4084];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI5_READ_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AW_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI5_WRITE_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI5_FN_MOD;

  uint8_t res23[4084];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI6_READ_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AW_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI6_WRITE_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI6_FN_MOD;

};

#define AXI (*(volatile struct AXI_tag *) 0x51001fd0)

struct CAN_CCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAY:8;
      uint64_t MON:8;
      uint64_t YEAR:4;
      uint64_t SUBSTEP:4;
      uint64_t STEP:4;
      uint64_t REL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TQBT:5;
      uint64_t reservedSpace0:1;
      uint64_t BCC:1;
      uint64_t CFL:1;
      uint64_t OCPM:8;
      uint64_t CDIV:4;
      uint64_t reservedSpace1:11;
      uint64_t SWR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCPC:18;
      uint64_t TQC:11;
      uint64_t reservedSpace0:1;
      uint64_t CALS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDC:16;
      uint64_t WDV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWE:1;
      uint64_t CSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWEE:1;
      uint64_t CSCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE;

};

#define CAN_CCU (*(volatile struct CAN_CCU_tag *) 0x4000a800)

struct CEC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CECEN:1;
      uint64_t TXSOM:1;
      uint64_t TXEOM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFT:3;
      uint64_t RXTOL:1;
      uint64_t BRESTP:1;
      uint64_t BREGEN:1;
      uint64_t LBPEGEN:1;
      uint64_t BRDNOGEN:1;
      uint64_t SFTOPT:1;
      uint64_t reservedSpace0:7;
      uint64_t OAR:15;
      uint64_t LSTN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBR:1;
      uint64_t RXEND:1;
      uint64_t RXOVR:1;
      uint64_t BRE:1;
      uint64_t SBPE:1;
      uint64_t LBPE:1;
      uint64_t RXACKE:1;
      uint64_t ARBLST:1;
      uint64_t TXBR:1;
      uint64_t TXEND:1;
      uint64_t TXUDR:1;
      uint64_t TXERR:1;
      uint64_t TXACKE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBRIE:1;
      uint64_t RXENDIE:1;
      uint64_t RXOVRIE:1;
      uint64_t BREIE:1;
      uint64_t SBPEIE:1;
      uint64_t LBPEIE:1;
      uint64_t RXACKIE:1;
      uint64_t ARBLSTIE:1;
      uint64_t TXBRIE:1;
      uint64_t TXENDIE:1;
      uint64_t TXUDRIE:1;
      uint64_t TXERRIE:1;
      uint64_t TXACKIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CEC (*(volatile struct CEC_tag *) 0x40006c00)

struct COMP1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1VAL:1;
      uint64_t C2VAL:1;
      uint64_t reservedSpace0:14;
      uint64_t C1IF:1;
      uint64_t C2IF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CC1IF:1;
      uint64_t CC2IF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFOP:11;
      uint64_t OR:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t BRGEN:1;
      uint64_t SCALEN:1;
      uint64_t POLARITY:1;
      uint64_t reservedSpace0:2;
      uint64_t ITEN:1;
      uint64_t reservedSpace1:1;
      uint64_t HYST:2;
      uint64_t reservedSpace2:2;
      uint64_t PWRMODE:2;
      uint64_t reservedSpace3:2;
      uint64_t INMSEL:3;
      uint64_t reservedSpace4:1;
      uint64_t INPSEL:1;
      uint64_t reservedSpace5:3;
      uint64_t BLANKING:4;
      uint64_t reservedSpace6:3;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t BRGEN:1;
      uint64_t SCALEN:1;
      uint64_t POLARITY:1;
      uint64_t WINMODE:1;
      uint64_t reservedSpace0:1;
      uint64_t ITEN:1;
      uint64_t reservedSpace1:1;
      uint64_t HYST:2;
      uint64_t reservedSpace2:2;
      uint64_t PWRMODE:2;
      uint64_t reservedSpace3:2;
      uint64_t INMSEL:3;
      uint64_t reservedSpace4:1;
      uint64_t INPSEL:1;
      uint64_t reservedSpace5:3;
      uint64_t BLANKING:4;
      uint64_t reservedSpace6:3;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR2;

