iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
};

#define DAC (*(volatile struct DAC_tag *) 0x40007400)

struct DBGMCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ID:12;
      uint64_t reservedSpace0:4;
      uint64_t REV_ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGSLPD1:1;
      uint64_t DBGSTPD1:1;
      uint64_t DBGSTBD1:1;
      uint64_t DBGSLPD2:1;
      uint64_t DBGSTPD2:1;
      uint64_t DBGSTBD2:1;
      uint64_t reservedSpace0:1;
      uint64_t DBGSTPD3:1;
      uint64_t DBGSTBD3:1;
      uint64_t reservedSpace1:11;
      uint64_t TRACECLKEN:1;
      uint64_t D1DBGCKEN:1;
      uint64_t D3DBGCKEN:1;
      uint64_t reservedSpace2:5;
      uint64_t TRGOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  uint8_t res0[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t WWDG1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB3FZ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t WWDG1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB3FZ2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_TIM2:1;
      uint64_t DBG_TIM3:1;
      uint64_t DBG_TIM4:1;
      uint64_t DBG_TIM5:1;
      uint64_t DBG_TIM6:1;
      uint64_t DBG_TIM7:1;
      uint64_t DBG_TIM12:1;
      uint64_t DBG_TIM13:1;
      uint64_t DBG_TIM14:1;
      uint64_t DBG_LPTIM1:1;
      uint64_t reservedSpace0:1;
      uint64_t DBG_WWDG2:1;
      uint64_t reservedSpace1:9;
      uint64_t DBG_I2C1:1;
      uint64_t DBG_I2C2:1;
      uint64_t DBG_I2C3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1LFZ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_TIM2:1;
      uint64_t DBG_TIM3:1;
      uint64_t DBG_TIM4:1;
      uint64_t DBG_TIM5:1;
      uint64_t DBG_TIM6:1;
      uint64_t DBG_TIM7:1;
      uint64_t DBG_TIM12:1;
      uint64_t DBG_TIM13:1;
      uint64_t DBG_TIM14:1;
      uint64_t DBG_LPTIM1:1;
      uint64_t reservedSpace0:1;
      uint64_t DBG_WWDG2:1;
      uint64_t reservedSpace1:9;
      uint64_t DBG_I2C1:1;
      uint64_t DBG_I2C2:1;
      uint64_t DBG_I2C3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1LFZ2;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_TIM1:1;
      uint64_t DBG_TIM8:1;
      uint64_t reservedSpace0:14;
      uint64_t DBG_TIM15:1;
      uint64_t DBG_TIM16:1;
      uint64_t DBG_TIM17:1;
      uint64_t reservedSpace1:10;
      uint64_t DBG_HRTIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2FZ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_TIM1:1;
      uint64_t DBG_TIM8:1;
      uint64_t reservedSpace0:14;
      uint64_t DBG_TIM15:1;
      uint64_t DBG_TIM16:1;
      uint64_t DBG_TIM17:1;
      uint64_t reservedSpace1:10;
      uint64_t DBG_HRTIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2FZ2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t DBG_I2C4:1;
      uint64_t reservedSpace1:1;
      uint64_t DBG_LPTIM2:1;
      uint64_t DBG_LPTIM3:1;
      uint64_t DBG_LPTIM4:1;
      uint64_t DBG_LPTIM5:1;
      uint64_t reservedSpace2:3;
      uint64_t DBG_RTC:1;
      uint64_t reservedSpace3:1;
      uint64_t DBG_WDGLSD1:1;
      uint64_t DBG_WDGLSD2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB4FZ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t DBG_I2C4:1;
      uint64_t reservedSpace1:1;
      uint64_t DBG_LPTIM2:1;
      uint64_t DBG_LPTIM3:1;
      uint64_t DBG_LPTIM4:1;
      uint64_t DBG_LPTIM5:1;
      uint64_t reservedSpace2:3;
      uint64_t DBG_RTC:1;
      uint64_t reservedSpace3:1;
      uint64_t DBG_WDGLSD1:1;
      uint64_t DBG_WDGLSD2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB4FZ2;

};

#define DBGMCU (*(volatile struct DBGMCU_tag *) 0x5c001000)

struct DCMI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE:1;
      uint64_t CM:1;
      uint64_t CROP:1;
      uint64_t JPEG:1;
      uint64_t ESS:1;
      uint64_t PCKPOL:1;
      uint64_t HSPOL:1;
      uint64_t VSPOL:1;
      uint64_t FCRC:2;
      uint64_t EDM:2;
      uint64_t reservedSpace0:2;
      uint64_t ENABLE:1;
      uint64_t reservedSpace1:1;
      uint64_t BSM:2;
      uint64_t OEBS:1;
      uint64_t LSM:1;
      uint64_t OELS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSYNC:1;
      uint64_t VSYNC:1;
      uint64_t FNE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_RIS:1;
      uint64_t OVR_RIS:1;
      uint64_t ERR_RIS:1;
      uint64_t VSYNC_RIS:1;
      uint64_t LINE_RIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_IE:1;
      uint64_t OVR_IE:1;
      uint64_t ERR_IE:1;
      uint64_t VSYNC_IE:1;
      uint64_t LINE_IE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_MIS:1;
      uint64_t OVR_MIS:1;
      uint64_t ERR_MIS:1;
      uint64_t VSYNC_MIS:1;
      uint64_t LINE_MIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_ISC:1;
      uint64_t OVR_ISC:1;
      uint64_t ERR_ISC:1;
      uint64_t VSYNC_ISC:1;
      uint64_t LINE_ISC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSC:8;
      uint64_t LSC:8;
      uint64_t LEC:8;
      uint64_t FEC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSU:8;
      uint64_t LSU:8;
      uint64_t LEU:8;
      uint64_t FEU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOFFCNT:14;
      uint64_t reservedSpace0:2;
      uint64_t VST:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSTRT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPCNT:14;
      uint64_t reservedSpace0:2;
      uint64_t VLINE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Byte0:8;
      uint64_t Byte1:8;
      uint64_t Byte2:8;
      uint64_t Byte3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

