iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
};

#define DCMI (*(volatile struct DCMI_tag *) 0x48020000)

struct DELAY_Block_SDMMC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t UNIT:7;
      uint64_t reservedSpace1:1;
      uint64_t LNG:12;
      uint64_t reservedSpace2:3;
      uint64_t LNGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

};

#define DELAY_Block_SDMMC1 (*(volatile struct DELAY_Block_SDMMC1_tag *) 0x52008000)

struct DELAY_Block_SDMMC2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t UNIT:7;
      uint64_t reservedSpace1:1;
      uint64_t LNG:12;
      uint64_t reservedSpace2:3;
      uint64_t LNGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

};

#define DELAY_Block_SDMMC2 (*(volatile struct DELAY_Block_SDMMC2_tag *) 0x48022800)

struct DFSDM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
      uint64_t CKOUTDIV:8;
      uint64_t reservedSpace2:6;
      uint64_t CKOUTSRC:1;
      uint64_t DFSDMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0AWSCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0WDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0DATINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLSSKP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0DLYR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1AWSCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1WDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1DATINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLSSKP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1DLYR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2AWSCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2WDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2DATINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLSSKP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2DLYR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3AWSCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3WDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3DATINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLSSKP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3DLYR;

