iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4AWSCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4WDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4DATINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLSSKP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4DLYR;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5AWSCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5WDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5DATINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLSSKP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5DLYR;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6AWSCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6WDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6DATINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLSSKP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6DLYR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SITP:2;
      uint64_t SPICKSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t SCDEN:1;
      uint64_t CKABEN:1;
      uint64_t CHEN:1;
      uint64_t CHINSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DATMPX:2;
      uint64_t DATPACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DTRBS:5;
      uint64_t OFFSET:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCDT:8;
      uint64_t reservedSpace0:4;
      uint64_t BKSCD:4;
      uint64_t AWFOSR:5;
      uint64_t reservedSpace1:1;
      uint64_t AWFORD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7AWSCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7WDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDAT0:16;
      uint64_t INDAT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7DATINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLSSKP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7DLYR;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFEN:1;
      uint64_t JSWSTART:1;
      uint64_t reservedSpace0:1;
      uint64_t JSYNC:1;
      uint64_t JSCAN:1;
      uint64_t JDMAEN:1;
      uint64_t reservedSpace1:2;
      uint64_t JEXTSEL:3;
      uint64_t reservedSpace2:2;
      uint64_t JEXTEN:2;
      uint64_t reservedSpace3:2;
      uint64_t RSWSTART:1;
      uint64_t RCONT:1;
      uint64_t RSYNC:1;
      uint64_t reservedSpace4:1;
      uint64_t RDMAEN:1;
      uint64_t reservedSpace5:2;
      uint64_t RCH:3;
      uint64_t reservedSpace6:2;
      uint64_t FAST:1;
      uint64_t AWFSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEOCIE:1;
      uint64_t REOCIE:1;
      uint64_t JOVRIE:1;
      uint64_t ROVRIE:1;
      uint64_t AWDIE:1;
      uint64_t SCDIE:1;
      uint64_t CKABIE:1;
      uint64_t reservedSpace0:1;
      uint64_t EXCH:8;
      uint64_t AWDCH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEOCF:1;
      uint64_t REOCF:1;
      uint64_t JOVRF:1;
      uint64_t ROVRF:1;
      uint64_t AWDF:1;
      uint64_t reservedSpace0:8;
      uint64_t JCIP:1;
      uint64_t RCIP:1;
      uint64_t reservedSpace1:1;
      uint64_t CKABF:8;
      uint64_t SCDF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLRJOVRF:1;
      uint64_t CLRROVRF:1;
      uint64_t reservedSpace1:12;
      uint64_t CLRCKABF:8;
      uint64_t CLRSCDF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCHG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0JCHGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOSR:8;
      uint64_t reservedSpace0:8;
      uint64_t FOSR:10;
      uint64_t reservedSpace1:3;
      uint64_t FORD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATACH:3;
      uint64_t reservedSpace0:5;
      uint64_t JDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0JDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATACH:3;
      uint64_t reservedSpace0:1;
      uint64_t RPEND:1;
      uint64_t reservedSpace1:3;
      uint64_t RDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0RDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKAWH:4;
      uint64_t reservedSpace0:4;
      uint64_t AWHT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0AWHTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKAWL:4;
      uint64_t reservedSpace0:4;
      uint64_t AWLT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0AWLTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWLTF:8;
      uint64_t AWHTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0AWSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRAWLTF:8;
      uint64_t CLRAWHTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0AWCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMAXCH:3;
      uint64_t reservedSpace0:5;
      uint64_t EXMAX:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0EXMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMINCH:3;
      uint64_t reservedSpace0:5;
      uint64_t EXMIN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0EXMIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CNVCNT:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT0CNVTIMR;

  uint8_t res8[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFEN:1;
      uint64_t JSWSTART:1;
      uint64_t reservedSpace0:1;
      uint64_t JSYNC:1;
      uint64_t JSCAN:1;
      uint64_t JDMAEN:1;
      uint64_t reservedSpace1:2;
      uint64_t JEXTSEL:3;
      uint64_t reservedSpace2:2;
      uint64_t JEXTEN:2;
      uint64_t reservedSpace3:2;
      uint64_t RSWSTART:1;
      uint64_t RCONT:1;
      uint64_t RSYNC:1;
      uint64_t reservedSpace4:1;
      uint64_t RDMAEN:1;
      uint64_t reservedSpace5:2;
      uint64_t RCH:3;
      uint64_t reservedSpace6:2;
      uint64_t FAST:1;
      uint64_t AWFSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEOCIE:1;
      uint64_t REOCIE:1;
      uint64_t JOVRIE:1;
      uint64_t ROVRIE:1;
      uint64_t AWDIE:1;
      uint64_t SCDIE:1;
      uint64_t CKABIE:1;
      uint64_t reservedSpace0:1;
      uint64_t EXCH:8;
      uint64_t AWDCH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEOCF:1;
      uint64_t REOCF:1;
      uint64_t JOVRF:1;
      uint64_t ROVRF:1;
      uint64_t AWDF:1;
      uint64_t reservedSpace0:8;
      uint64_t JCIP:1;
      uint64_t RCIP:1;
      uint64_t reservedSpace1:1;
      uint64_t CKABF:8;
      uint64_t SCDF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLRJOVRF:1;
      uint64_t CLRROVRF:1;
      uint64_t reservedSpace1:12;
      uint64_t CLRCKABF:8;
      uint64_t CLRSCDF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM1_ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCHG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1JCHGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOSR:8;
      uint64_t reservedSpace0:8;
      uint64_t FOSR:10;
      uint64_t reservedSpace1:3;
      uint64_t FORD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM1_FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATACH:3;
      uint64_t reservedSpace0:5;
      uint64_t JDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1JDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATACH:3;
      uint64_t reservedSpace0:1;
      uint64_t RPEND:1;
      uint64_t reservedSpace1:3;
      uint64_t RDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1RDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKAWH:4;
      uint64_t reservedSpace0:4;
      uint64_t AWHT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1AWHTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKAWL:4;
      uint64_t reservedSpace0:4;
      uint64_t AWLT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1AWLTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWLTF:8;
      uint64_t AWHTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1AWSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRAWLTF:8;
      uint64_t CLRAWHTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1AWCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMAXCH:3;
      uint64_t reservedSpace0:5;
      uint64_t EXMAX:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1EXMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMINCH:3;
      uint64_t reservedSpace0:5;
      uint64_t EXMIN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1EXMIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CNVCNT:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT1CNVTIMR;

