iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res9[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFEN:1;
      uint64_t JSWSTART:1;
      uint64_t reservedSpace0:1;
      uint64_t JSYNC:1;
      uint64_t JSCAN:1;
      uint64_t JDMAEN:1;
      uint64_t reservedSpace1:2;
      uint64_t JEXTSEL:3;
      uint64_t reservedSpace2:2;
      uint64_t JEXTEN:2;
      uint64_t reservedSpace3:2;
      uint64_t RSWSTART:1;
      uint64_t RCONT:1;
      uint64_t RSYNC:1;
      uint64_t reservedSpace4:1;
      uint64_t RDMAEN:1;
      uint64_t reservedSpace5:2;
      uint64_t RCH:3;
      uint64_t reservedSpace6:2;
      uint64_t FAST:1;
      uint64_t AWFSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEOCIE:1;
      uint64_t REOCIE:1;
      uint64_t JOVRIE:1;
      uint64_t ROVRIE:1;
      uint64_t AWDIE:1;
      uint64_t SCDIE:1;
      uint64_t CKABIE:1;
      uint64_t reservedSpace0:1;
      uint64_t EXCH:8;
      uint64_t AWDCH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEOCF:1;
      uint64_t REOCF:1;
      uint64_t JOVRF:1;
      uint64_t ROVRF:1;
      uint64_t AWDF:1;
      uint64_t reservedSpace0:8;
      uint64_t JCIP:1;
      uint64_t RCIP:1;
      uint64_t reservedSpace1:1;
      uint64_t CKABF:8;
      uint64_t SCDF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLRJOVRF:1;
      uint64_t CLRROVRF:1;
      uint64_t reservedSpace1:12;
      uint64_t CLRCKABF:8;
      uint64_t CLRSCDF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCHG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2JCHGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOSR:8;
      uint64_t reservedSpace0:8;
      uint64_t FOSR:10;
      uint64_t reservedSpace1:3;
      uint64_t FORD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATACH:3;
      uint64_t reservedSpace0:5;
      uint64_t JDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2JDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATACH:3;
      uint64_t reservedSpace0:1;
      uint64_t RPEND:1;
      uint64_t reservedSpace1:3;
      uint64_t RDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2RDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKAWH:4;
      uint64_t reservedSpace0:4;
      uint64_t AWHT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2AWHTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKAWL:4;
      uint64_t reservedSpace0:4;
      uint64_t AWLT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2AWLTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWLTF:8;
      uint64_t AWHTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2AWSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRAWLTF:8;
      uint64_t CLRAWHTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2AWCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMAXCH:3;
      uint64_t reservedSpace0:5;
      uint64_t EXMAX:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2EXMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMINCH:3;
      uint64_t reservedSpace0:5;
      uint64_t EXMIN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2EXMIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CNVCNT:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT2CNVTIMR;

  uint8_t res10[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFEN:1;
      uint64_t JSWSTART:1;
      uint64_t reservedSpace0:1;
      uint64_t JSYNC:1;
      uint64_t JSCAN:1;
      uint64_t JDMAEN:1;
      uint64_t reservedSpace1:2;
      uint64_t JEXTSEL:3;
      uint64_t reservedSpace2:2;
      uint64_t JEXTEN:2;
      uint64_t reservedSpace3:2;
      uint64_t RSWSTART:1;
      uint64_t RCONT:1;
      uint64_t RSYNC:1;
      uint64_t reservedSpace4:1;
      uint64_t RDMAEN:1;
      uint64_t reservedSpace5:2;
      uint64_t RCH:3;
      uint64_t reservedSpace6:2;
      uint64_t FAST:1;
      uint64_t AWFSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEOCIE:1;
      uint64_t REOCIE:1;
      uint64_t JOVRIE:1;
      uint64_t ROVRIE:1;
      uint64_t AWDIE:1;
      uint64_t SCDIE:1;
      uint64_t CKABIE:1;
      uint64_t reservedSpace0:1;
      uint64_t EXCH:8;
      uint64_t AWDCH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEOCF:1;
      uint64_t REOCF:1;
      uint64_t JOVRF:1;
      uint64_t ROVRF:1;
      uint64_t AWDF:1;
      uint64_t reservedSpace0:8;
      uint64_t JCIP:1;
      uint64_t RCIP:1;
      uint64_t reservedSpace1:1;
      uint64_t CKABF:8;
      uint64_t SCDF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLRJOVRF:1;
      uint64_t CLRROVRF:1;
      uint64_t reservedSpace1:12;
      uint64_t CLRCKABF:8;
      uint64_t CLRSCDF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JCHG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3JCHGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOSR:8;
      uint64_t reservedSpace0:8;
      uint64_t FOSR:10;
      uint64_t reservedSpace1:3;
      uint64_t FORD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATACH:3;
      uint64_t reservedSpace0:5;
      uint64_t JDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3JDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATACH:3;
      uint64_t reservedSpace0:1;
      uint64_t RPEND:1;
      uint64_t reservedSpace1:3;
      uint64_t RDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3RDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKAWH:4;
      uint64_t reservedSpace0:4;
      uint64_t AWHT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3AWHTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKAWL:4;
      uint64_t reservedSpace0:4;
      uint64_t AWLT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3AWLTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWLTF:8;
      uint64_t AWHTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3AWSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRAWLTF:8;
      uint64_t CLRAWHTF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3AWCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMAXCH:3;
      uint64_t reservedSpace0:5;
      uint64_t EXMAX:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3EXMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMINCH:3;
      uint64_t reservedSpace0:5;
      uint64_t EXMIN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3EXMIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CNVCNT:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSDM_FLT3CNVTIMR;

