iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
};

#define DMAMUX3 (*(volatile struct DMAMUX3_tag *) 0x58025800)

struct Delay_Block_OCTOSPI1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t UNIT:7;
      uint64_t reservedSpace1:1;
      uint64_t LNG:12;
      uint64_t reservedSpace2:3;
      uint64_t LNGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

};

#define Delay_Block_OCTOSPI1 (*(volatile struct Delay_Block_OCTOSPI1_tag *) 0x52006000)

struct Delay_Block_OCTOSPI2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t UNIT:7;
      uint64_t reservedSpace1:1;
      uint64_t LNG:12;
      uint64_t reservedSpace2:3;
      uint64_t LNGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

};

#define Delay_Block_OCTOSPI2 (*(volatile struct Delay_Block_OCTOSPI2_tag *) 0x5200b000)

struct EXTI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR0:1;
      uint64_t TR1:1;
      uint64_t TR2:1;
      uint64_t TR3:1;
      uint64_t TR4:1;
      uint64_t TR5:1;
      uint64_t TR6:1;
      uint64_t TR7:1;
      uint64_t TR8:1;
      uint64_t TR9:1;
      uint64_t TR10:1;
      uint64_t TR11:1;
      uint64_t TR12:1;
      uint64_t TR13:1;
      uint64_t TR14:1;
      uint64_t TR15:1;
      uint64_t TR16:1;
      uint64_t TR17:1;
      uint64_t TR18:1;
      uint64_t TR19:1;
      uint64_t TR20:1;
      uint64_t TR21:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR0:1;
      uint64_t TR1:1;
      uint64_t TR2:1;
      uint64_t TR3:1;
      uint64_t TR4:1;
      uint64_t TR5:1;
      uint64_t TR6:1;
      uint64_t TR7:1;
      uint64_t TR8:1;
      uint64_t TR9:1;
      uint64_t TR10:1;
      uint64_t TR11:1;
      uint64_t TR12:1;
      uint64_t TR13:1;
      uint64_t TR14:1;
      uint64_t TR15:1;
      uint64_t TR16:1;
      uint64_t TR17:1;
      uint64_t TR18:1;
      uint64_t TR19:1;
      uint64_t TR20:1;
      uint64_t TR21:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWIER0:1;
      uint64_t SWIER1:1;
      uint64_t SWIER2:1;
      uint64_t SWIER3:1;
      uint64_t SWIER4:1;
      uint64_t SWIER5:1;
      uint64_t SWIER6:1;
      uint64_t SWIER7:1;
      uint64_t SWIER8:1;
      uint64_t SWIER9:1;
      uint64_t SWIER10:1;
      uint64_t SWIER11:1;
      uint64_t SWIER12:1;
      uint64_t SWIER13:1;
      uint64_t SWIER14:1;
      uint64_t SWIER15:1;
      uint64_t SWIER16:1;
      uint64_t SWIER17:1;
      uint64_t SWIER18:1;
      uint64_t SWIER19:1;
      uint64_t SWIER20:1;
      uint64_t SWIER21:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0:1;
      uint64_t MR1:1;
      uint64_t MR2:1;
      uint64_t MR3:1;
      uint64_t MR4:1;
      uint64_t MR5:1;
      uint64_t MR6:1;
      uint64_t MR7:1;
      uint64_t MR8:1;
      uint64_t MR9:1;
      uint64_t MR10:1;
      uint64_t MR11:1;
      uint64_t MR12:1;
      uint64_t MR13:1;
      uint64_t MR14:1;
      uint64_t MR15:1;
      uint64_t reservedSpace0:3;
      uint64_t MR19:1;
      uint64_t MR20:1;
      uint64_t MR21:1;
      uint64_t reservedSpace1:3;
      uint64_t MR25:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3PMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0:2;
      uint64_t PCS1:2;
      uint64_t PCS2:2;
      uint64_t PCS3:2;
      uint64_t PCS4:2;
      uint64_t PCS5:2;
      uint64_t PCS6:2;
      uint64_t PCS7:2;
      uint64_t PCS8:2;
      uint64_t PCS9:2;
      uint64_t PCS10:2;
      uint64_t PCS11:2;
      uint64_t PCS12:2;
      uint64_t PCS13:2;
      uint64_t PCS14:2;
      uint64_t PCS15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3PCR1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t PCS19:2;
      uint64_t PCS20:2;
      uint64_t PCS21:2;
      uint64_t reservedSpace1:6;
      uint64_t PCS25:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3PCR1H;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t TR49:1;
      uint64_t reservedSpace1:1;
      uint64_t TR51:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t TR49:1;
      uint64_t reservedSpace1:1;
      uint64_t TR51:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t SWIER49:1;
      uint64_t reservedSpace1:1;
      uint64_t SWIER51:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t MR34:1;
      uint64_t MR35:1;
      uint64_t reservedSpace1:5;
      uint64_t MR41:1;
      uint64_t reservedSpace2:6;
      uint64_t MR48:1;
      uint64_t MR49:1;
      uint64_t MR50:1;
      uint64_t MR51:1;
      uint64_t MR52:1;
      uint64_t MR53:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3PMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PCS34:2;
      uint64_t PCS35:2;
      uint64_t reservedSpace1:10;
      uint64_t PCS41:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3PCR2L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS48:2;
      uint64_t PCS49:2;
      uint64_t PCS50:2;
      uint64_t PCS51:2;
      uint64_t PCS52:2;
      uint64_t PCS53:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3PCR2H;

