iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t TR82:1;
      uint64_t reservedSpace1:1;
      uint64_t TR84:1;
      uint64_t TR85:1;
      uint64_t TR86:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t TR82:1;
      uint64_t reservedSpace1:1;
      uint64_t TR84:1;
      uint64_t TR85:1;
      uint64_t TR86:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t SWIER82:1;
      uint64_t reservedSpace1:1;
      uint64_t SWIER84:1;
      uint64_t SWIER85:1;
      uint64_t SWIER86:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t MR88:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3PMR3;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t PCS88:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3PCR3H;

  uint8_t res3[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0:1;
      uint64_t MR1:1;
      uint64_t MR2:1;
      uint64_t MR3:1;
      uint64_t MR4:1;
      uint64_t MR5:1;
      uint64_t MR6:1;
      uint64_t MR7:1;
      uint64_t MR8:1;
      uint64_t MR9:1;
      uint64_t MR10:1;
      uint64_t MR11:1;
      uint64_t MR12:1;
      uint64_t MR13:1;
      uint64_t MR14:1;
      uint64_t MR15:1;
      uint64_t MR16:1;
      uint64_t MR17:1;
      uint64_t MR18:1;
      uint64_t MR19:1;
      uint64_t MR20:1;
      uint64_t MR21:1;
      uint64_t MR22:1;
      uint64_t MR23:1;
      uint64_t MR24:1;
      uint64_t MR25:1;
      uint64_t MR26:1;
      uint64_t MR27:1;
      uint64_t MR28:1;
      uint64_t MR29:1;
      uint64_t MR30:1;
      uint64_t MR31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0:1;
      uint64_t MR1:1;
      uint64_t MR2:1;
      uint64_t MR3:1;
      uint64_t MR4:1;
      uint64_t MR5:1;
      uint64_t MR6:1;
      uint64_t MR7:1;
      uint64_t MR8:1;
      uint64_t MR9:1;
      uint64_t MR10:1;
      uint64_t MR11:1;
      uint64_t MR12:1;
      uint64_t MR13:1;
      uint64_t MR14:1;
      uint64_t MR15:1;
      uint64_t MR16:1;
      uint64_t MR17:1;
      uint64_t MR18:1;
      uint64_t MR19:1;
      uint64_t MR20:1;
      uint64_t MR21:1;
      uint64_t MR22:1;
      uint64_t MR23:1;
      uint64_t MR24:1;
      uint64_t MR25:1;
      uint64_t MR26:1;
      uint64_t MR27:1;
      uint64_t MR28:1;
      uint64_t MR29:1;
      uint64_t MR30:1;
      uint64_t MR31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUEMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR0:1;
      uint64_t PR1:1;
      uint64_t PR2:1;
      uint64_t PR3:1;
      uint64_t PR4:1;
      uint64_t PR5:1;
      uint64_t PR6:1;
      uint64_t PR7:1;
      uint64_t PR8:1;
      uint64_t PR9:1;
      uint64_t PR10:1;
      uint64_t PR11:1;
      uint64_t PR12:1;
      uint64_t PR13:1;
      uint64_t PR14:1;
      uint64_t PR15:1;
      uint64_t PR16:1;
      uint64_t PR17:1;
      uint64_t PR18:1;
      uint64_t PR19:1;
      uint64_t PR20:1;
      uint64_t PR21:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUPR1;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0:1;
      uint64_t MR1:1;
      uint64_t MR2:1;
      uint64_t MR3:1;
      uint64_t MR4:1;
      uint64_t MR5:1;
      uint64_t MR6:1;
      uint64_t MR7:1;
      uint64_t MR8:1;
      uint64_t MR9:1;
      uint64_t MR10:1;
      uint64_t MR11:1;
      uint64_t MR12:1;
      uint64_t reservedSpace0:1;
      uint64_t MR14:1;
      uint64_t MR15:1;
      uint64_t MR16:1;
      uint64_t MR17:1;
      uint64_t MR18:1;
      uint64_t MR19:1;
      uint64_t MR20:1;
      uint64_t MR21:1;
      uint64_t MR22:1;
      uint64_t MR23:1;
      uint64_t MR24:1;
      uint64_t MR25:1;
      uint64_t MR26:1;
      uint64_t MR27:1;
      uint64_t MR28:1;
      uint64_t MR29:1;
      uint64_t MR30:1;
      uint64_t MR31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR32:1;
      uint64_t MR33:1;
      uint64_t MR34:1;
      uint64_t MR35:1;
      uint64_t MR36:1;
      uint64_t MR37:1;
      uint64_t MR38:1;
      uint64_t MR39:1;
      uint64_t MR40:1;
      uint64_t MR41:1;
      uint64_t MR42:1;
      uint64_t MR43:1;
      uint64_t MR44:1;
      uint64_t reservedSpace0:1;
      uint64_t MR46:1;
      uint64_t MR47:1;
      uint64_t MR48:1;
      uint64_t MR49:1;
      uint64_t MR50:1;
      uint64_t MR51:1;
      uint64_t MR52:1;
      uint64_t MR53:1;
      uint64_t MR54:1;
      uint64_t MR55:1;
      uint64_t MR56:1;
      uint64_t MR57:1;
      uint64_t MR58:1;
      uint64_t MR59:1;
      uint64_t MR60:1;
      uint64_t MR61:1;
      uint64_t MR62:1;
      uint64_t MR63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUEMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t PR49:1;
      uint64_t reservedSpace1:1;
      uint64_t PR51:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUPR2;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR64:1;
      uint64_t MR65:1;
      uint64_t MR66:1;
      uint64_t MR67:1;
      uint64_t MR68:1;
      uint64_t MR69:1;
      uint64_t MR70:1;
      uint64_t MR71:1;
      uint64_t MR72:1;
      uint64_t MR73:1;
      uint64_t MR74:1;
      uint64_t MR75:1;
      uint64_t MR76:1;
      uint64_t MR77:1;
      uint64_t MR78:1;
      uint64_t MR79:1;
      uint64_t MR80:1;
      uint64_t reservedSpace0:1;
      uint64_t MR82:1;
      uint64_t reservedSpace1:1;
      uint64_t MR84:1;
      uint64_t MR85:1;
      uint64_t MR86:1;
      uint64_t MR87:1;
      uint64_t MR88:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR64:1;
      uint64_t MR65:1;
      uint64_t MR66:1;
      uint64_t MR67:1;
      uint64_t MR68:1;
      uint64_t MR69:1;
      uint64_t MR70:1;
      uint64_t MR71:1;
      uint64_t MR72:1;
      uint64_t MR73:1;
      uint64_t MR74:1;
      uint64_t MR75:1;
      uint64_t MR76:1;
      uint64_t MR77:1;
      uint64_t MR78:1;
      uint64_t MR79:1;
      uint64_t MR80:1;
      uint64_t reservedSpace0:1;
      uint64_t MR82:1;
      uint64_t reservedSpace1:1;
      uint64_t MR84:1;
      uint64_t MR85:1;
      uint64_t MR86:1;
      uint64_t MR87:1;
      uint64_t MR88:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUEMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t PR82:1;
      uint64_t reservedSpace1:1;
      uint64_t PR84:1;
      uint64_t PR85:1;
      uint64_t PR86:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUPR3;

