iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
};

#define EXTI (*(volatile struct EXTI_tag *) 0x58000000)

struct Ethernet_MAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t PRELEN:2;
      uint64_t DC:1;
      uint64_t BL:2;
      uint64_t reservedSpace0:1;
      uint64_t DR:1;
      uint64_t DCRS:1;
      uint64_t DO:1;
      uint64_t ECRSFD:1;
      uint64_t LM:1;
      uint64_t DM:1;
      uint64_t FES:1;
      uint64_t reservedSpace1:1;
      uint64_t JE:1;
      uint64_t JD:1;
      uint64_t reservedSpace2:1;
      uint64_t WD:1;
      uint64_t ACS:1;
      uint64_t CST:1;
      uint64_t S2KP:1;
      uint64_t GPSLCE:1;
      uint64_t IPG:3;
      uint64_t IPC:1;
      uint64_t SARC:3;
      uint64_t ARPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPSL:14;
      uint64_t reservedSpace0:2;
      uint64_t DCRCC:1;
      uint64_t SPEN:1;
      uint64_t USP:1;
      uint64_t reservedSpace1:5;
      uint64_t EIPGEN:1;
      uint64_t EIPG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:1;
      uint64_t HUC:1;
      uint64_t HMC:1;
      uint64_t DAIF:1;
      uint64_t PM:1;
      uint64_t DBF:1;
      uint64_t PCF:2;
      uint64_t SAIF:1;
      uint64_t SAF:1;
      uint64_t HPF:1;
      uint64_t reservedSpace0:5;
      uint64_t VTFE:1;
      uint64_t reservedSpace1:3;
      uint64_t IPFE:1;
      uint64_t DNTU:1;
      uint64_t reservedSpace2:9;
      uint64_t RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTO:4;
      uint64_t reservedSpace0:4;
      uint64_t PWE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACWTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HT31T0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHT0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HT63T32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHT1R;

  uint8_t res0[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VL:16;
      uint64_t ETV:1;
      uint64_t VTIM:1;
      uint64_t ESVL:1;
      uint64_t ERSVLM:1;
      uint64_t DOVLTC:1;
      uint64_t EVLS:2;
      uint64_t reservedSpace0:1;
      uint64_t EVLRXS:1;
      uint64_t VTHM:1;
      uint64_t EDVLP:1;
      uint64_t ERIVLT:1;
      uint64_t EIVLS:2;
      uint64_t reservedSpace1:1;
      uint64_t EIVLRXS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACVTR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLHT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACVHTR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLT:16;
      uint64_t VLC:2;
      uint64_t VLP:1;
      uint64_t CSVL:1;
      uint64_t VLTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACVIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLT:16;
      uint64_t VLC:2;
      uint64_t VLP:1;
      uint64_t CSVL:1;
      uint64_t VLTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACIVIR;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCB_BPA:1;
      uint64_t TFE:1;
      uint64_t reservedSpace0:2;
      uint64_t PLT:3;
      uint64_t DZPQ:1;
      uint64_t reservedSpace1:8;
      uint64_t PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACQTxFCR;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFE:1;
      uint64_t UP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACRxFCR;

  uint8_t res5[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PHYIS:1;
      uint64_t PMTIS:1;
      uint64_t LPIIS:1;
      uint64_t reservedSpace1:2;
      uint64_t MMCIS:1;
      uint64_t MMCRXIS:1;
      uint64_t MMCTXIS:1;
      uint64_t reservedSpace2:1;
      uint64_t TSIS:1;
      uint64_t TXSTSIS:1;
      uint64_t RXSTSIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PHYIE:1;
      uint64_t PMTIE:1;
      uint64_t LPIIE:1;
      uint64_t reservedSpace1:6;
      uint64_t TSIE:1;
      uint64_t TXSTSIE:1;
      uint64_t RXSTSIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TJT:1;
      uint64_t NCARR:1;
      uint64_t LCARR:1;
      uint64_t EXDEF:1;
      uint64_t LCOL:1;
      uint64_t EXCOL:1;
      uint64_t reservedSpace0:2;
      uint64_t RWT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACRxTxSR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRDWN:1;
      uint64_t MGKPKTEN:1;
      uint64_t RWKPKTEN:1;
      uint64_t reservedSpace0:2;
      uint64_t MGKPRCVD:1;
      uint64_t RWKPRCVD:1;
      uint64_t reservedSpace1:2;
      uint64_t GLBLUCAST:1;
      uint64_t RWKPFE:1;
      uint64_t reservedSpace2:13;
      uint64_t RWKPTR:5;
      uint64_t reservedSpace3:2;
      uint64_t RWKFILTRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPFRMFTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACRWKPFR;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLPIEN:1;
      uint64_t TLPIEX:1;
      uint64_t RLPIEN:1;
      uint64_t RLPIEX:1;
      uint64_t reservedSpace0:4;
      uint64_t TLPIST:1;
      uint64_t RLPIST:1;
      uint64_t reservedSpace1:6;
      uint64_t LPIEN:1;
      uint64_t PLS:1;
      uint64_t PLSEN:1;
      uint64_t LPITXA:1;
      uint64_t LPITE:1;
      uint64_t LPITCSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACLCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWT:16;
      uint64_t LST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACLTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPIET:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACLETR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIC_1US_CNTR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC1USTCR;

  uint8_t res8[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SNPSVER:8;
      uint64_t USERVER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPESTS:1;
      uint64_t RFCFCSTS:2;
      uint64_t reservedSpace0:13;
      uint64_t TPESTS:1;
      uint64_t TFCSTS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACDR;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFIFOSIZE:5;
      uint64_t reservedSpace0:1;
      uint64_t TXFIFOSIZE:5;
      uint64_t OSTEN:1;
      uint64_t PTOEN:1;
      uint64_t ADVTHWORD:1;
      uint64_t reservedSpace1:2;
      uint64_t DCBEN:1;
      uint64_t SPHEN:1;
      uint64_t TSOEN:1;
      uint64_t DBGMEMA:1;
      uint64_t AVSEL:1;
      uint64_t reservedSpace2:3;
      uint64_t HASHTBLSZ:2;
      uint64_t reservedSpace3:1;
      uint64_t L3L4FNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHWF1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXQCNT:4;
      uint64_t reservedSpace0:2;
      uint64_t TXQCNT:4;
      uint64_t reservedSpace1:2;
      uint64_t RXCHCNT:4;
      uint64_t reservedSpace2:2;
      uint64_t TXCHCNT:4;
      uint64_t reservedSpace3:2;
      uint64_t PPSOUTNUM:3;
      uint64_t reservedSpace4:1;
      uint64_t AUXSNAPNUM:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHWF2R;

  uint8_t res10[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB:1;
      uint64_t C45E:1;
      uint64_t GOC:2;
      uint64_t SKAP:1;
      uint64_t reservedSpace0:3;
      uint64_t CR:4;
      uint64_t NTC:3;
      uint64_t reservedSpace1:1;
      uint64_t RDA:5;
      uint64_t PA:5;
      uint64_t BTB:1;
      uint64_t PSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACMDIOAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:16;
      uint64_t RA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACMDIODR;

  uint8_t res11[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRHI:16;
      uint64_t reservedSpace0:15;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA0HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA0LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA1HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA1LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA2HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA2LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA3HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA3LR;

  uint8_t res12[992];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTRST:1;
      uint64_t CNTSTOPRO:1;
      uint64_t RSTONRD:1;
      uint64_t CNTFREEZ:1;
      uint64_t CNTPRST:1;
      uint64_t CNTPRSTLVL:1;
      uint64_t reservedSpace0:2;
      uint64_t UCDBC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t RXCRCERPIS:1;
      uint64_t RXALGNERPIS:1;
      uint64_t reservedSpace1:10;
      uint64_t RXUCGPIS:1;
      uint64_t reservedSpace2:8;
      uint64_t RXLPIUSCIS:1;
      uint64_t RXLPITRCIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RX_INTERRUPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t TXSCOLGPIS:1;
      uint64_t TXMCOLGPIS:1;
      uint64_t reservedSpace1:5;
      uint64_t TXGPKTIS:1;
      uint64_t reservedSpace2:4;
      uint64_t TXLPIUSCIS:1;
      uint64_t TXLPITRCIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TX_INTERRUPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t RXCRCERPIM:1;
      uint64_t RXALGNERPIM:1;
      uint64_t reservedSpace1:10;
      uint64_t RXUCGPIM:1;
      uint64_t reservedSpace2:8;
      uint64_t RXLPIUSCIM:1;
      uint64_t RXLPITRCIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RX_INTERRUPT_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t TXSCOLGPIM:1;
      uint64_t TXMCOLGPIM:1;
      uint64_t reservedSpace1:5;
      uint64_t TXGPKTIM:1;
      uint64_t reservedSpace2:4;
      uint64_t TXLPIUSCIM:1;
      uint64_t TXLPITRCIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TX_INTERRUPT_MASK;

  uint8_t res13[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXSNGLCOLG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_SINGLE_COLLISION_GOOD_PACKETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMULTCOLG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_MULTIPLE_COLLISION_GOOD_PACKETS;

  uint8_t res14[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PACKET_COUNT_GOOD;

