iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res15[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCRCERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_CRC_ERROR_PACKETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXALGNERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ALIGNMENT_ERROR_PACKETS;

  uint8_t res16[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXUCASTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_UNICAST_PACKETS_GOOD;

  uint8_t res17[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLPIUSC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_LPI_USEC_CNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLPITRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_LPI_TRAN_CNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXLPIUSC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_LPI_USEC_CNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXLPITRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_LPI_TRAN_CNTR;

  uint8_t res18[260];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3PEN0:1;
      uint64_t reservedSpace0:1;
      uint64_t L3SAM0:1;
      uint64_t L3SAIM0:1;
      uint64_t L3DAM0:1;
      uint64_t L3DAIM0:1;
      uint64_t L3HSBM0:5;
      uint64_t L3HDBM0:5;
      uint64_t L4PEN0:1;
      uint64_t reservedSpace1:1;
      uint64_t L4SPM0:1;
      uint64_t L4SPIM0:1;
      uint64_t L4DPM0:1;
      uint64_t L4DPIM0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3L4C0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L4SP0:16;
      uint64_t L4DP0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL4A0R;

  uint8_t res19[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3A00:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3A00R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3A10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3A10R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3A20:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3A20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3A30:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3A30;

  uint8_t res20[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3PEN1:1;
      uint64_t reservedSpace0:1;
      uint64_t L3SAM1:1;
      uint64_t L3SAIM1:1;
      uint64_t L3DAM1:1;
      uint64_t L3DAIM1:1;
      uint64_t L3HSBM1:5;
      uint64_t L3HDBM1:5;
      uint64_t L4PEN1:1;
      uint64_t reservedSpace1:1;
      uint64_t L4SPM1:1;
      uint64_t L4SPIM1:1;
      uint64_t L4DPM1:1;
      uint64_t L4DPIM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3L4C1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L4SP1:16;
      uint64_t L4DP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL4A1R;

  uint8_t res21[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3A01:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3A01R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3A11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3A11R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3A21:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3A21R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3A31:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACL3A31R;

  uint8_t res22[400];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARPPA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACARPAR;

  uint8_t res23[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSENA:1;
      uint64_t TSCFUPDT:1;
      uint64_t TSINIT:1;
      uint64_t TSUPDT:1;
      uint64_t reservedSpace0:1;
      uint64_t TSADDREG:1;
      uint64_t reservedSpace1:2;
      uint64_t TSENALL:1;
      uint64_t TSCTRLSSR:1;
      uint64_t TSVER2ENA:1;
      uint64_t TSIPENA:1;
      uint64_t TSIPV6ENA:1;
      uint64_t TSIPV4ENA:1;
      uint64_t TSEVNTENA:1;
      uint64_t TSMSTRENA:1;
      uint64_t SNAPTYPSEL:2;
      uint64_t TSENMACADDR:1;
      uint64_t CSC:1;
      uint64_t reservedSpace2:4;
      uint64_t TXTSSTSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SNSINC:8;
      uint64_t SSINC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSSIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSTNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSTSUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSS:31;
      uint64_t ADDSUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSTNUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTSAR;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSOVF:1;
      uint64_t TSTARGT0:1;
      uint64_t AUXTSTRIG:1;
      uint64_t TSTRGTERR0:1;
      uint64_t reservedSpace0:11;
      uint64_t TXTSSIS:1;
      uint64_t ATSSTN:4;
      uint64_t reservedSpace1:4;
      uint64_t ATSSTM:1;
      uint64_t ATSNS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTSSR;

  uint8_t res25[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXTSSLO:31;
      uint64_t TXTSSMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTxTSSNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXTSSHI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTxTSSSR;

  uint8_t res26[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATSFC:1;
      uint64_t reservedSpace0:3;
      uint64_t ATSEN0:1;
      uint64_t ATSEN1:1;
      uint64_t ATSEN2:1;
      uint64_t ATSEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACACR;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUXTSLO:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACATSNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUXTSHI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACATSSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSTIAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTSIACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSTEAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTSEACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSIC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTSICNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACTSECNR;

  uint8_t res28[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSCTRL:4;
      uint64_t PPSEN0:1;
      uint64_t TRGTMODSEL0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPPSCR;

  uint8_t res29[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSTRH0:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPPSTTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TTSL0:31;
      uint64_t TRGTBUSY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPPSTTNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSINT0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPPSIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSWIDTH0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPPSWR;

  uint8_t res30[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTOEN:1;
      uint64_t ASYNCEN:1;
      uint64_t APDREQEN:1;
      uint64_t reservedSpace0:1;
      uint64_t ASYNCTRIG:1;
      uint64_t APDREQTRIG:1;
      uint64_t DRRDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t DN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSPI0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI1_bitfield:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSPI1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI2_bitfield:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSPI2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSI:8;
      uint64_t DRSYNCR:3;
      uint64_t reservedSpace0:13;
      uint64_t LMPDRI:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACLMIR;

  uint8_t res31[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DTXSTS:1;
      uint64_t reservedSpace1:6;
      uint64_t CNTPRST:1;
      uint64_t CNTCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLOMR;

  uint8_t res32[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Q0IS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLISR;

  uint8_t res33[220];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTQ:1;
      uint64_t TSF:1;
      uint64_t TXQEN:2;
      uint64_t TTC:3;
      uint64_t reservedSpace0:9;
      uint64_t TQS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLTxQOMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UFFRMCNT:11;
      uint64_t UFCNTOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLTxQUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXQPAUSED:1;
      uint64_t TRCSTS:2;
      uint64_t TWCSTS:1;
      uint64_t TXQSTS:1;
      uint64_t TXSTSFSTS:1;
      uint64_t reservedSpace0:10;
      uint64_t PTXQ:3;
      uint64_t reservedSpace1:1;
      uint64_t STXSTSF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLTxQDR;

  uint8_t res34[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXUNFIS:1;
      uint64_t reservedSpace0:7;
      uint64_t TXUIE:1;
      uint64_t reservedSpace1:7;
      uint64_t RXOVFIS:1;
      uint64_t reservedSpace2:7;
      uint64_t RXOIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLQICSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_bitfield:2;
      uint64_t reservedSpace0:1;
      uint64_t FUP:1;
      uint64_t FEP:1;
      uint64_t RSF:1;
      uint64_t DIS_TCP_EF:1;
      uint64_t EHFC:1;
      uint64_t RFA:3;
      uint64_t reservedSpace1:3;
      uint64_t RFD:3;
      uint64_t reservedSpace2:3;
      uint64_t RQS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLRxQOMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVFPKTCNT:11;
      uint64_t OVFCNTOVF:1;
      uint64_t reservedSpace0:4;
      uint64_t MISPKTCNT:11;
      uint64_t MISCNTOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLRxQMPOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWCSTS:1;
      uint64_t RRCSTS:2;
      uint64_t reservedSpace0:1;
      uint64_t RXQSTS:2;
      uint64_t reservedSpace1:10;
      uint64_t PRXQ:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTLRxQDR;

