iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res35[708];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t DA:1;
      uint64_t reservedSpace0:9;
      uint64_t TXPR:1;
      uint64_t PR:3;
      uint64_t reservedSpace1:1;
      uint64_t INTM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FB:1;
      uint64_t reservedSpace0:11;
      uint64_t AAL:1;
      uint64_t reservedSpace1:1;
      uint64_t MB:1;
      uint64_t RB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMASBMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DC0IS:1;
      uint64_t reservedSpace0:15;
      uint64_t MTLIS:1;
      uint64_t MACIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AXWHSTS:1;
      uint64_t reservedSpace0:7;
      uint64_t RPS0:4;
      uint64_t TPS0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMADSR;

  uint8_t res36[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSS:14;
      uint64_t reservedSpace0:2;
      uint64_t PBLX8:1;
      uint64_t reservedSpace1:1;
      uint64_t DSL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST:1;
      uint64_t reservedSpace0:3;
      uint64_t OSF:1;
      uint64_t reservedSpace1:7;
      uint64_t TSE:1;
      uint64_t reservedSpace2:3;
      uint64_t TXPBL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACTxCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SR:1;
      uint64_t RBSZ:14;
      uint64_t reservedSpace0:1;
      uint64_t RXPBL:6;
      uint64_t reservedSpace1:9;
      uint64_t RPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACRxCR;

  uint8_t res37[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TDESLA:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACTxDLAR;

  uint8_t res38[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RDESLA:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACRxDLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TDT:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACTxDTPR;

  uint8_t res39[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RDT:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACRxDTPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACTxRLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACRxRLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:1;
      uint64_t TXSE:1;
      uint64_t TBUE:1;
      uint64_t reservedSpace0:3;
      uint64_t RIE:1;
      uint64_t RBUE:1;
      uint64_t RSE:1;
      uint64_t RWTE:1;
      uint64_t ETIE:1;
      uint64_t ERIE:1;
      uint64_t FBEE:1;
      uint64_t CDEE:1;
      uint64_t AIE:1;
      uint64_t NIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACRxIWTR;

  uint8_t res40[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURTDESAPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACCATxDR;

  uint8_t res41[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRDESAPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACCARxDR;

  uint8_t res42[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURTBUFAPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACCATxBR;

  uint8_t res43[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRBUFAPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACCARxBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI:1;
      uint64_t TPS:1;
      uint64_t TBU:1;
      uint64_t reservedSpace0:3;
      uint64_t RI:1;
      uint64_t RBU:1;
      uint64_t RPS:1;
      uint64_t RWT:1;
      uint64_t ET:1;
      uint64_t ER:1;
      uint64_t FBE:1;
      uint64_t CDE:1;
      uint64_t AIS:1;
      uint64_t NIS:1;
      uint64_t TEB:3;
      uint64_t REB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACSR;

  uint8_t res44[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFC:11;
      uint64_t reservedSpace0:4;
      uint64_t MFCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACMFCR;

};

#define Ethernet_MAC (*(volatile struct Ethernet_MAC_tag *) 0x40028000)

struct FDCAN1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAY:8;
      uint64_t MON:8;
      uint64_t YEAR:4;
      uint64_t SUBSTEP:4;
      uint64_t STEP:4;
      uint64_t REL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_CREL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_ENDN;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSJW:4;
      uint64_t DTSEG2:4;
      uint64_t DTSEG1:5;
      uint64_t reservedSpace0:3;
      uint64_t DBRP:5;
      uint64_t reservedSpace1:2;
      uint64_t TDC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_DBTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LBCK:1;
      uint64_t TX:2;
      uint64_t RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDC:8;
      uint64_t WDV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t CCE:1;
      uint64_t ASM:1;
      uint64_t CSA:1;
      uint64_t CSR:1;
      uint64_t MON:1;
      uint64_t DAR:1;
      uint64_t TEST:1;
      uint64_t FDOE:1;
      uint64_t BSE:1;
      uint64_t reservedSpace0:2;
      uint64_t PXHD:1;
      uint64_t EFBI:1;
      uint64_t TXP:1;
      uint64_t NISO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_CCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEG2:7;
      uint64_t reservedSpace0:1;
      uint64_t NTSEG1:8;
      uint64_t NBRP:9;
      uint64_t NSJW:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_NBTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:2;
      uint64_t reservedSpace0:14;
      uint64_t TCP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TSCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TSCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETOC:1;
      uint64_t TOS:2;
      uint64_t reservedSpace0:13;
      uint64_t TOP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TOCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TOCV;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEC:8;
      uint64_t TREC:7;
      uint64_t RP:1;
      uint64_t CEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t ACT:2;
      uint64_t EP:1;
      uint64_t EW:1;
      uint64_t BO:1;
      uint64_t DLEC:3;
      uint64_t RESI:1;
      uint64_t RBRS:1;
      uint64_t REDL:1;
      uint64_t PXE:1;
      uint64_t reservedSpace0:1;
      uint64_t TDCV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_PSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDCF:7;
      uint64_t reservedSpace0:1;
      uint64_t TDCO:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TDCR;

