iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0N:1;
      uint64_t RF0W:1;
      uint64_t RF0F:1;
      uint64_t RF0L:1;
      uint64_t RF1N:1;
      uint64_t RF1W:1;
      uint64_t RF1F:1;
      uint64_t RF1L:1;
      uint64_t HPM:1;
      uint64_t TC:1;
      uint64_t TCF:1;
      uint64_t TEF:1;
      uint64_t TEFN:1;
      uint64_t TEFW:1;
      uint64_t TEFF:1;
      uint64_t TEFL:1;
      uint64_t TSW:1;
      uint64_t MRAF:1;
      uint64_t TOO:1;
      uint64_t DRX:1;
      uint64_t reservedSpace0:2;
      uint64_t ELO:1;
      uint64_t EP:1;
      uint64_t EW:1;
      uint64_t BO:1;
      uint64_t WDI:1;
      uint64_t PEA:1;
      uint64_t PED:1;
      uint64_t ARA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0NE:1;
      uint64_t RF0WE:1;
      uint64_t RF0FE:1;
      uint64_t RF0LE:1;
      uint64_t RF1NE:1;
      uint64_t RF1WE:1;
      uint64_t RF1FE:1;
      uint64_t RF1LE:1;
      uint64_t HPME:1;
      uint64_t TCE:1;
      uint64_t TCFE:1;
      uint64_t TEFE:1;
      uint64_t TEFNE:1;
      uint64_t TEFWE:1;
      uint64_t TEFFE:1;
      uint64_t TEFLE:1;
      uint64_t TSWE:1;
      uint64_t MRAFE:1;
      uint64_t TOOE:1;
      uint64_t DRXE:1;
      uint64_t BECE:1;
      uint64_t BEUE:1;
      uint64_t ELOE:1;
      uint64_t EPE:1;
      uint64_t EWE:1;
      uint64_t BOE:1;
      uint64_t WDIE:1;
      uint64_t PEAE:1;
      uint64_t PEDE:1;
      uint64_t ARAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0NL:1;
      uint64_t RF0WL:1;
      uint64_t RF0FL:1;
      uint64_t RF0LL:1;
      uint64_t RF1NL:1;
      uint64_t RF1WL:1;
      uint64_t RF1FL:1;
      uint64_t RF1LL:1;
      uint64_t HPML:1;
      uint64_t TCL:1;
      uint64_t TCFL:1;
      uint64_t TEFL:1;
      uint64_t TEFNL:1;
      uint64_t TEFWL:1;
      uint64_t TEFFL:1;
      uint64_t TEFLL:1;
      uint64_t TSWL:1;
      uint64_t MRAFL:1;
      uint64_t TOOL:1;
      uint64_t DRXL:1;
      uint64_t BECL:1;
      uint64_t BEUL:1;
      uint64_t ELOL:1;
      uint64_t EPL:1;
      uint64_t EWL:1;
      uint64_t BOL:1;
      uint64_t WDIL:1;
      uint64_t PEAL:1;
      uint64_t PEDL:1;
      uint64_t ARAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_ILS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EINT0:1;
      uint64_t EINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_ILE;

  uint8_t res3[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RRFE:1;
      uint64_t RRFS:1;
      uint64_t ANFE:2;
      uint64_t ANFS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_GFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t FLSSA:14;
      uint64_t LSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_SIDFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t FLESA:14;
      uint64_t LSE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_XIDFC;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIDM:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_XIDAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIDX:6;
      uint64_t MSI:2;
      uint64_t FIDX:7;
      uint64_t FLST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_HPMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ND0:1;
      uint64_t ND1:1;
      uint64_t ND2:1;
      uint64_t ND3:1;
      uint64_t ND4:1;
      uint64_t ND5:1;
      uint64_t ND6:1;
      uint64_t ND7:1;
      uint64_t ND8:1;
      uint64_t ND9:1;
      uint64_t ND10:1;
      uint64_t ND11:1;
      uint64_t ND12:1;
      uint64_t ND13:1;
      uint64_t ND14:1;
      uint64_t ND15:1;
      uint64_t ND16:1;
      uint64_t ND17:1;
      uint64_t ND18:1;
      uint64_t ND19:1;
      uint64_t ND20:1;
      uint64_t ND21:1;
      uint64_t ND22:1;
      uint64_t ND23:1;
      uint64_t ND24:1;
      uint64_t ND25:1;
      uint64_t ND26:1;
      uint64_t ND27:1;
      uint64_t ND28:1;
      uint64_t ND29:1;
      uint64_t ND30:1;
      uint64_t ND31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_NDAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ND32:1;
      uint64_t ND33:1;
      uint64_t ND34:1;
      uint64_t ND35:1;
      uint64_t ND36:1;
      uint64_t ND37:1;
      uint64_t ND38:1;
      uint64_t ND39:1;
      uint64_t ND40:1;
      uint64_t ND41:1;
      uint64_t ND42:1;
      uint64_t ND43:1;
      uint64_t ND44:1;
      uint64_t ND45:1;
      uint64_t ND46:1;
      uint64_t ND47:1;
      uint64_t ND48:1;
      uint64_t ND49:1;
      uint64_t ND50:1;
      uint64_t ND51:1;
      uint64_t ND52:1;
      uint64_t ND53:1;
      uint64_t ND54:1;
      uint64_t ND55:1;
      uint64_t ND56:1;
      uint64_t ND57:1;
      uint64_t ND58:1;
      uint64_t ND59:1;
      uint64_t ND60:1;
      uint64_t ND61:1;
      uint64_t ND62:1;
      uint64_t ND63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_NDAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t F0SA:14;
      uint64_t F0S:8;
      uint64_t F0WM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF0C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F0G:6;
      uint64_t reservedSpace1:2;
      uint64_t F0P:6;
      uint64_t reservedSpace2:2;
      uint64_t F0F:1;
      uint64_t RF0L:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF0S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FA01:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF0A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RBSA:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t F1SA:14;
      uint64_t F1S:7;
      uint64_t reservedSpace1:1;
      uint64_t F1WM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF1C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F1GI:7;
      uint64_t reservedSpace1:1;
      uint64_t F1PI:7;
      uint64_t reservedSpace2:1;
      uint64_t F1F:1;
      uint64_t RF1L:1;
      uint64_t reservedSpace3:4;
      uint64_t DMS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF1S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1AI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0DS:3;
      uint64_t reservedSpace0:1;
      uint64_t F1DS:3;
      uint64_t reservedSpace1:1;
      uint64_t RBDS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TBSA:14;
      uint64_t NDTB:6;
      uint64_t reservedSpace1:2;
      uint64_t TFQS:6;
      uint64_t TFQM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t TFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t TFQPI:5;
      uint64_t TFQF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXFQS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBDS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBTIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBCIE;

