iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EFSA:14;
      uint64_t EFS:6;
      uint64_t reservedSpace1:2;
      uint64_t EFWM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXEFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t EFGI:5;
      uint64_t reservedSpace1:11;
      uint64_t EFF:1;
      uint64_t TEFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXEFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFAI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXEFA;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TMSA:14;
      uint64_t TME:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTTMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RID:29;
      uint64_t reservedSpace0:1;
      uint64_t XTD:1;
      uint64_t RMPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTRMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OM:2;
      uint64_t reservedSpace0:1;
      uint64_t GEN:1;
      uint64_t TM:1;
      uint64_t LDSDL:3;
      uint64_t IRTO:7;
      uint64_t EECS:1;
      uint64_t AWL:8;
      uint64_t EGTF:1;
      uint64_t ECC:1;
      uint64_t EVTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTOCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCM:6;
      uint64_t CSS:2;
      uint64_t TXEW:4;
      uint64_t reservedSpace0:4;
      uint64_t ENTT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTMLM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCL:16;
      uint64_t DC:14;
      uint64_t reservedSpace0:1;
      uint64_t ELT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TURCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SGT:1;
      uint64_t ECS:1;
      uint64_t SWP:1;
      uint64_t SWS:2;
      uint64_t RTIE:1;
      uint64_t TMC:2;
      uint64_t TTIE:1;
      uint64_t GCS:1;
      uint64_t FGP:1;
      uint64_t TMG:1;
      uint64_t NIG:1;
      uint64_t ESCN:1;
      uint64_t reservedSpace0:1;
      uint64_t LCKC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTOCN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCL:16;
      uint64_t CTP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN_TTGTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TM:16;
      uint64_t TICC:7;
      uint64_t reservedSpace0:8;
      uint64_t LCKM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTTMK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBC:1;
      uint64_t SMC:1;
      uint64_t CSM:1;
      uint64_t SOG:1;
      uint64_t RTMI:1;
      uint64_t TTMI:1;
      uint64_t SWE:1;
      uint64_t GTW:1;
      uint64_t GTD:1;
      uint64_t GTE:1;
      uint64_t TXU:1;
      uint64_t TXO:1;
      uint64_t SE1:1;
      uint64_t SE2:1;
      uint64_t ELC:1;
      uint64_t IWTG:1;
      uint64_t WT:1;
      uint64_t AW:1;
      uint64_t CER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBCE:1;
      uint64_t SMCE:1;
      uint64_t CSME:1;
      uint64_t SOGE:1;
      uint64_t RTMIE:1;
      uint64_t TTMIE:1;
      uint64_t SWEE:1;
      uint64_t GTWE:1;
      uint64_t GTDE:1;
      uint64_t GTEE:1;
      uint64_t TXUE:1;
      uint64_t TXOE:1;
      uint64_t SE1E:1;
      uint64_t SE2E:1;
      uint64_t ELCE:1;
      uint64_t IWTGE:1;
      uint64_t WTE:1;
      uint64_t AWE:1;
      uint64_t CERE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBCL:1;
      uint64_t SMCL:1;
      uint64_t CSML:1;
      uint64_t SOGL:1;
      uint64_t RTMIL:1;
      uint64_t TTMIL:1;
      uint64_t SWEL:1;
      uint64_t GTWL:1;
      uint64_t GTDL:1;
      uint64_t GTEL:1;
      uint64_t TXUL:1;
      uint64_t TXOL:1;
      uint64_t SE1L:1;
      uint64_t SE2L:1;
      uint64_t ELCL:1;
      uint64_t IWTGL:1;
      uint64_t WTL:1;
      uint64_t AWL:1;
      uint64_t CERL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTILS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EL:2;
      uint64_t MS:2;
      uint64_t SYS:2;
      uint64_t GTP:1;
      uint64_t QCS:1;
      uint64_t RTO:8;
      uint64_t reservedSpace0:6;
      uint64_t WGTD:1;
      uint64_t GFI:1;
      uint64_t TMP:3;
      uint64_t GSI:1;
      uint64_t WFE:1;
      uint64_t AWE:1;
      uint64_t WECS:1;
      uint64_t SPL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTOST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NAV:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TURNA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LT:16;
      uint64_t GT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTLGT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT:16;
      uint64_t CC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTCTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT:6;
      uint64_t reservedSpace0:10;
      uint64_t SWV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTCPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTCSM;

  uint8_t res7[444];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWTDEL:2;
      uint64_t reservedSpace0:2;
      uint64_t EVTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TTTS;

