iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res0[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWAITEN:1;
      uint64_t PBKEN:1;
      uint64_t reservedSpace1:1;
      uint64_t PWID:2;
      uint64_t ECCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t TCLR:4;
      uint64_t TAR:4;
      uint64_t ECCPS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRS:1;
      uint64_t ILS:1;
      uint64_t IFS:1;
      uint64_t IREN:1;
      uint64_t ILEN:1;
      uint64_t IFEN:1;
      uint64_t FEMPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEMSET:8;
      uint64_t MEMWAIT:8;
      uint64_t MEMHOLD:8;
      uint64_t MEMHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATTSET:8;
      uint64_t ATTWAIT:8;
      uint64_t ATTHOLD:8;
      uint64_t ATTHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATT;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR;

  uint8_t res2[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t reservedSpace0:8;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BWTR1;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t reservedSpace0:8;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BWTR2;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t reservedSpace0:8;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BWTR3;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t reservedSpace0:8;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BWTR4;

  uint8_t res6[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NC:2;
      uint64_t NR:2;
      uint64_t MWID:2;
      uint64_t NB:1;
      uint64_t CAS:2;
      uint64_t WP:1;
      uint64_t SDCLK:2;
      uint64_t RBURST:1;
      uint64_t RPIPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NC:2;
      uint64_t NR:2;
      uint64_t MWID:2;
      uint64_t NB:1;
      uint64_t CAS:2;
      uint64_t WP:1;
      uint64_t SDCLK:2;
      uint64_t RBURST:1;
      uint64_t RPIPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRD:4;
      uint64_t TXSR:4;
      uint64_t TRAS:4;
      uint64_t TRC:4;
      uint64_t TWR:4;
      uint64_t TRP:4;
      uint64_t TRCD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRD:4;
      uint64_t TXSR:4;
      uint64_t TRAS:4;
      uint64_t TRC:4;
      uint64_t TWR:4;
      uint64_t TRP:4;
      uint64_t TRCD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t CTB2:1;
      uint64_t CTB1:1;
      uint64_t NRFS:4;
      uint64_t MRD:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRE:1;
      uint64_t COUNT:13;
      uint64_t REIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDRTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RE:1;
      uint64_t MODES1:2;
      uint64_t MODES2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDSR;

};

#define FMC (*(volatile struct FMC_tag *) 0x52004000)

struct FPU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSPACT:1;
      uint64_t USER:1;
      uint64_t reservedSpace0:1;
      uint64_t THREAD:1;
      uint64_t HFRDY:1;
      uint64_t MMRDY:1;
      uint64_t BFRDY:1;
      uint64_t reservedSpace1:1;
      uint64_t MONRDY:1;
      uint64_t reservedSpace2:21;
      uint64_t LSPEN:1;
      uint64_t ASPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDRESS:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPCAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOC:1;
      uint64_t DZC:1;
      uint64_t OFC:1;
      uint64_t UFC:1;
      uint64_t IXC:1;
      uint64_t reservedSpace0:2;
      uint64_t IDC:1;
      uint64_t reservedSpace1:14;
      uint64_t RMode:2;
      uint64_t FZ:1;
      uint64_t DN:1;
      uint64_t AHP:1;
      uint64_t reservedSpace2:1;
      uint64_t V:1;
      uint64_t C:1;
      uint64_t Z:1;
      uint64_t N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPSCR;

};

#define FPU (*(volatile struct FPU_tag *) 0xe000ef34)

struct FPU_CPACR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t CP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPACR;

};

#define FPU_CPACR (*(volatile struct FPU_CPACR_tag *) 0xe000ed88)

struct GPIOA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:2;
      uint64_t MODE1:2;
      uint64_t MODE2:2;
      uint64_t MODE3:2;
      uint64_t MODE4:2;
      uint64_t MODE5:2;
      uint64_t MODE6:2;
      uint64_t MODE7:2;
      uint64_t MODE8:2;
      uint64_t MODE9:2;
      uint64_t MODE10:2;
      uint64_t MODE11:2;
      uint64_t MODE12:2;
      uint64_t MODE13:2;
      uint64_t MODE14:2;
      uint64_t MODE15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OT0:1;
      uint64_t OT1:1;
      uint64_t OT2:1;
      uint64_t OT3:1;
      uint64_t OT4:1;
      uint64_t OT5:1;
      uint64_t OT6:1;
      uint64_t OT7:1;
      uint64_t OT8:1;
      uint64_t OT9:1;
      uint64_t OT10:1;
      uint64_t OT11:1;
      uint64_t OT12:1;
      uint64_t OT13:1;
      uint64_t OT14:1;
      uint64_t OT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTYPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSPEED0:2;
      uint64_t OSPEED1:2;
      uint64_t OSPEED2:2;
      uint64_t OSPEED3:2;
      uint64_t OSPEED4:2;
      uint64_t OSPEED5:2;
      uint64_t OSPEED6:2;
      uint64_t OSPEED7:2;
      uint64_t OSPEED8:2;
      uint64_t OSPEED9:2;
      uint64_t OSPEED10:2;
      uint64_t OSPEED11:2;
      uint64_t OSPEED12:2;
      uint64_t OSPEED13:2;
      uint64_t OSPEED14:2;
      uint64_t OSPEED15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSPEEDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PUPD0:2;
      uint64_t PUPD1:2;
      uint64_t PUPD2:2;
      uint64_t PUPD3:2;
      uint64_t PUPD4:2;
      uint64_t PUPD5:2;
      uint64_t PUPD6:2;
      uint64_t PUPD7:2;
      uint64_t PUPD8:2;
      uint64_t PUPD9:2;
      uint64_t PUPD10:2;
      uint64_t PUPD11:2;
      uint64_t PUPD12:2;
      uint64_t PUPD13:2;
      uint64_t PUPD14:2;
      uint64_t PUPD15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID0:1;
      uint64_t ID1:1;
      uint64_t ID2:1;
      uint64_t ID3:1;
      uint64_t ID4:1;
      uint64_t ID5:1;
      uint64_t ID6:1;
      uint64_t ID7:1;
      uint64_t ID8:1;
      uint64_t ID9:1;
      uint64_t ID10:1;
      uint64_t ID11:1;
      uint64_t ID12:1;
      uint64_t ID13:1;
      uint64_t ID14:1;
      uint64_t ID15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OD0:1;
      uint64_t OD1:1;
      uint64_t OD2:1;
      uint64_t OD3:1;
      uint64_t OD4:1;
      uint64_t OD5:1;
      uint64_t OD6:1;
      uint64_t OD7:1;
      uint64_t OD8:1;
      uint64_t OD9:1;
      uint64_t OD10:1;
      uint64_t OD11:1;
      uint64_t OD12:1;
      uint64_t OD13:1;
      uint64_t OD14:1;
      uint64_t OD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ODR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BS0:1;
      uint64_t BS1:1;
      uint64_t BS2:1;
      uint64_t BS3:1;
      uint64_t BS4:1;
      uint64_t BS5:1;
      uint64_t BS6:1;
      uint64_t BS7:1;
      uint64_t BS8:1;
      uint64_t BS9:1;
      uint64_t BS10:1;
      uint64_t BS11:1;
      uint64_t BS12:1;
      uint64_t BS13:1;
      uint64_t BS14:1;
      uint64_t BS15:1;
      uint64_t BR0:1;
      uint64_t BR1:1;
      uint64_t BR2:1;
      uint64_t BR3:1;
      uint64_t BR4:1;
      uint64_t BR5:1;
      uint64_t BR6:1;
      uint64_t BR7:1;
      uint64_t BR8:1;
      uint64_t BR9:1;
      uint64_t BR10:1;
      uint64_t BR11:1;
      uint64_t BR12:1;
      uint64_t BR13:1;
      uint64_t BR14:1;
      uint64_t BR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BSRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCK0:1;
      uint64_t LCK1:1;
      uint64_t LCK2:1;
      uint64_t LCK3:1;
      uint64_t LCK4:1;
      uint64_t LCK5:1;
      uint64_t LCK6:1;
      uint64_t LCK7:1;
      uint64_t LCK8:1;
      uint64_t LCK9:1;
      uint64_t LCK10:1;
      uint64_t LCK11:1;
      uint64_t LCK12:1;
      uint64_t LCK13:1;
      uint64_t LCK14:1;
      uint64_t LCK15:1;
      uint64_t LCKK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFSEL0:4;
      uint64_t AFSEL1:4;
      uint64_t AFSEL2:4;
      uint64_t AFSEL3:4;
      uint64_t AFSEL4:4;
      uint64_t AFSEL5:4;
      uint64_t AFSEL6:4;
      uint64_t AFSEL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFSEL8:4;
      uint64_t AFSEL9:4;
      uint64_t AFSEL10:4;
      uint64_t AFSEL11:4;
      uint64_t AFSEL12:4;
      uint64_t AFSEL13:4;
      uint64_t AFSEL14:4;
      uint64_t AFSEL15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFRH;

