iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
};

#define GPIOJ (*(volatile struct GPIOJ_tag *) 0x58022400)

struct GPIOK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:2;
      uint64_t MODE1:2;
      uint64_t MODE2:2;
      uint64_t MODE3:2;
      uint64_t MODE4:2;
      uint64_t MODE5:2;
      uint64_t MODE6:2;
      uint64_t MODE7:2;
      uint64_t MODE8:2;
      uint64_t MODE9:2;
      uint64_t MODE10:2;
      uint64_t MODE11:2;
      uint64_t MODE12:2;
      uint64_t MODE13:2;
      uint64_t MODE14:2;
      uint64_t MODE15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OT0:1;
      uint64_t OT1:1;
      uint64_t OT2:1;
      uint64_t OT3:1;
      uint64_t OT4:1;
      uint64_t OT5:1;
      uint64_t OT6:1;
      uint64_t OT7:1;
      uint64_t OT8:1;
      uint64_t OT9:1;
      uint64_t OT10:1;
      uint64_t OT11:1;
      uint64_t OT12:1;
      uint64_t OT13:1;
      uint64_t OT14:1;
      uint64_t OT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTYPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSPEED0:2;
      uint64_t OSPEED1:2;
      uint64_t OSPEED2:2;
      uint64_t OSPEED3:2;
      uint64_t OSPEED4:2;
      uint64_t OSPEED5:2;
      uint64_t OSPEED6:2;
      uint64_t OSPEED7:2;
      uint64_t OSPEED8:2;
      uint64_t OSPEED9:2;
      uint64_t OSPEED10:2;
      uint64_t OSPEED11:2;
      uint64_t OSPEED12:2;
      uint64_t OSPEED13:2;
      uint64_t OSPEED14:2;
      uint64_t OSPEED15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSPEEDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PUPD0:2;
      uint64_t PUPD1:2;
      uint64_t PUPD2:2;
      uint64_t PUPD3:2;
      uint64_t PUPD4:2;
      uint64_t PUPD5:2;
      uint64_t PUPD6:2;
      uint64_t PUPD7:2;
      uint64_t PUPD8:2;
      uint64_t PUPD9:2;
      uint64_t PUPD10:2;
      uint64_t PUPD11:2;
      uint64_t PUPD12:2;
      uint64_t PUPD13:2;
      uint64_t PUPD14:2;
      uint64_t PUPD15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID0:1;
      uint64_t ID1:1;
      uint64_t ID2:1;
      uint64_t ID3:1;
      uint64_t ID4:1;
      uint64_t ID5:1;
      uint64_t ID6:1;
      uint64_t ID7:1;
      uint64_t ID8:1;
      uint64_t ID9:1;
      uint64_t ID10:1;
      uint64_t ID11:1;
      uint64_t ID12:1;
      uint64_t ID13:1;
      uint64_t ID14:1;
      uint64_t ID15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OD0:1;
      uint64_t OD1:1;
      uint64_t OD2:1;
      uint64_t OD3:1;
      uint64_t OD4:1;
      uint64_t OD5:1;
      uint64_t OD6:1;
      uint64_t OD7:1;
      uint64_t OD8:1;
      uint64_t OD9:1;
      uint64_t OD10:1;
      uint64_t OD11:1;
      uint64_t OD12:1;
      uint64_t OD13:1;
      uint64_t OD14:1;
      uint64_t OD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ODR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BS0:1;
      uint64_t BS1:1;
      uint64_t BS2:1;
      uint64_t BS3:1;
      uint64_t BS4:1;
      uint64_t BS5:1;
      uint64_t BS6:1;
      uint64_t BS7:1;
      uint64_t BS8:1;
      uint64_t BS9:1;
      uint64_t BS10:1;
      uint64_t BS11:1;
      uint64_t BS12:1;
      uint64_t BS13:1;
      uint64_t BS14:1;
      uint64_t BS15:1;
      uint64_t BR0:1;
      uint64_t BR1:1;
      uint64_t BR2:1;
      uint64_t BR3:1;
      uint64_t BR4:1;
      uint64_t BR5:1;
      uint64_t BR6:1;
      uint64_t BR7:1;
      uint64_t BR8:1;
      uint64_t BR9:1;
      uint64_t BR10:1;
      uint64_t BR11:1;
      uint64_t BR12:1;
      uint64_t BR13:1;
      uint64_t BR14:1;
      uint64_t BR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BSRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCK0:1;
      uint64_t LCK1:1;
      uint64_t LCK2:1;
      uint64_t LCK3:1;
      uint64_t LCK4:1;
      uint64_t LCK5:1;
      uint64_t LCK6:1;
      uint64_t LCK7:1;
      uint64_t LCK8:1;
      uint64_t LCK9:1;
      uint64_t LCK10:1;
      uint64_t LCK11:1;
      uint64_t LCK12:1;
      uint64_t LCK13:1;
      uint64_t LCK14:1;
      uint64_t LCK15:1;
      uint64_t LCKK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFSEL0:4;
      uint64_t AFSEL1:4;
      uint64_t AFSEL2:4;
      uint64_t AFSEL3:4;
      uint64_t AFSEL4:4;
      uint64_t AFSEL5:4;
      uint64_t AFSEL6:4;
      uint64_t AFSEL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFSEL8:4;
      uint64_t AFSEL9:4;
      uint64_t AFSEL10:4;
      uint64_t AFSEL11:4;
      uint64_t AFSEL12:4;
      uint64_t AFSEL13:4;
      uint64_t AFSEL14:4;
      uint64_t AFSEL15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFRH;

};

#define GPIOK (*(volatile struct GPIOK_tag *) 0x58022800)

struct HSEM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_R31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_RLR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEM0:1;
      uint64_t ISEM1:1;
      uint64_t ISEM2:1;
      uint64_t ISEM3:1;
      uint64_t ISEM4:1;
      uint64_t ISEM5:1;
      uint64_t ISEM6:1;
      uint64_t ISEM7:1;
      uint64_t ISEM8:1;
      uint64_t ISEM9:1;
      uint64_t ISEM10:1;
      uint64_t ISEM11:1;
      uint64_t ISEM12:1;
      uint64_t ISEM13:1;
      uint64_t ISEM14:1;
      uint64_t ISEM15:1;
      uint64_t ISEM16:1;
      uint64_t ISEM17:1;
      uint64_t ISEM18:1;
      uint64_t ISEM19:1;
      uint64_t ISEM20:1;
      uint64_t ISEM21:1;
      uint64_t ISEM22:1;
      uint64_t ISEM23:1;
      uint64_t ISEM24:1;
      uint64_t ISEM25:1;
      uint64_t ISEM26:1;
      uint64_t ISEM27:1;
      uint64_t ISEM28:1;
      uint64_t ISEM29:1;
      uint64_t ISEM30:1;
      uint64_t ISEM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_C1IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEM0:1;
      uint64_t ISEM1:1;
      uint64_t ISEM2:1;
      uint64_t ISEM3:1;
      uint64_t ISEM4:1;
      uint64_t ISEM5:1;
      uint64_t ISEM6:1;
      uint64_t ISEM7:1;
      uint64_t ISEM8:1;
      uint64_t ISEM9:1;
      uint64_t ISEM10:1;
      uint64_t ISEM11:1;
      uint64_t ISEM12:1;
      uint64_t ISEM13:1;
      uint64_t ISEM14:1;
      uint64_t ISEM15:1;
      uint64_t ISEM16:1;
      uint64_t ISEM17:1;
      uint64_t ISEM18:1;
      uint64_t ISEM19:1;
      uint64_t ISEM20:1;
      uint64_t ISEM21:1;
      uint64_t ISEM22:1;
      uint64_t ISEM23:1;
      uint64_t ISEM24:1;
      uint64_t ISEM25:1;
      uint64_t ISEM26:1;
      uint64_t ISEM27:1;
      uint64_t ISEM28:1;
      uint64_t ISEM29:1;
      uint64_t ISEM30:1;
      uint64_t ISEM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_C1ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEM0:1;
      uint64_t ISEM1:1;
      uint64_t ISEM2:1;
      uint64_t ISEM3:1;
      uint64_t ISEM4:1;
      uint64_t ISEM5:1;
      uint64_t ISEM6:1;
      uint64_t ISEM7:1;
      uint64_t ISEM8:1;
      uint64_t ISEM9:1;
      uint64_t ISEM10:1;
      uint64_t ISEM11:1;
      uint64_t ISEM12:1;
      uint64_t ISEM13:1;
      uint64_t ISEM14:1;
      uint64_t ISEM15:1;
      uint64_t ISEM16:1;
      uint64_t ISEM17:1;
      uint64_t ISEM18:1;
      uint64_t ISEM19:1;
      uint64_t ISEM20:1;
      uint64_t ISEM21:1;
      uint64_t ISEM22:1;
      uint64_t ISEM23:1;
      uint64_t ISEM24:1;
      uint64_t ISEM25:1;
      uint64_t ISEM26:1;
      uint64_t ISEM27:1;
      uint64_t ISEM28:1;
      uint64_t ISEM29:1;
      uint64_t ISEM30:1;
      uint64_t ISEM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_C1ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEM0:1;
      uint64_t ISEM1:1;
      uint64_t ISEM2:1;
      uint64_t ISEM3:1;
      uint64_t ISEM4:1;
      uint64_t ISEM5:1;
      uint64_t ISEM6:1;
      uint64_t ISEM7:1;
      uint64_t ISEM8:1;
      uint64_t ISEM9:1;
      uint64_t ISEM10:1;
      uint64_t ISEM11:1;
      uint64_t ISEM12:1;
      uint64_t ISEM13:1;
      uint64_t ISEM14:1;
      uint64_t ISEM15:1;
      uint64_t ISEM16:1;
      uint64_t ISEM17:1;
      uint64_t ISEM18:1;
      uint64_t ISEM19:1;
      uint64_t ISEM20:1;
      uint64_t ISEM21:1;
      uint64_t ISEM22:1;
      uint64_t ISEM23:1;
      uint64_t ISEM24:1;
      uint64_t ISEM25:1;
      uint64_t ISEM26:1;
      uint64_t ISEM27:1;
      uint64_t ISEM28:1;
      uint64_t ISEM29:1;
      uint64_t ISEM30:1;
      uint64_t ISEM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_C1MISR;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t COREID:4;
      uint64_t reservedSpace1:4;
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSEM_KEYR;

