iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
};

#define MDIOS (*(volatile struct MDIOS_tag *) 0x40009400)

struct MDMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIF0:1;
      uint64_t GIF1:1;
      uint64_t GIF2:1;
      uint64_t GIF3:1;
      uint64_t GIF4:1;
      uint64_t GIF5:1;
      uint64_t GIF6:1;
      uint64_t GIF7:1;
      uint64_t GIF8:1;
      uint64_t GIF9:1;
      uint64_t GIF10:1;
      uint64_t GIF11:1;
      uint64_t GIF12:1;
      uint64_t GIF13:1;
      uint64_t GIF14:1;
      uint64_t GIF15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_GISR0;

  uint8_t res0[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF0:1;
      uint64_t CTCIF0:1;
      uint64_t BRTIF0:1;
      uint64_t BTIF0:1;
      uint64_t TCIF0:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF0:1;
      uint64_t CCTCIF0:1;
      uint64_t CBRTIF0:1;
      uint64_t CBTIF0:1;
      uint64_t CLTCIF0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0TBR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C0MDR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF1:1;
      uint64_t CTCIF1:1;
      uint64_t BRTIF1:1;
      uint64_t BTIF1:1;
      uint64_t TCIF1:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF1:1;
      uint64_t CCTCIF1:1;
      uint64_t CBRTIF1:1;
      uint64_t CBTIF1:1;
      uint64_t CLTCIF1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C1TBR;

