iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C11BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C11SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C11DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C11BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C11LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C11TBR;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C11MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C11MDR;

  uint8_t res24[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF12:1;
      uint64_t CTCIF12:1;
      uint64_t BRTIF12:1;
      uint64_t BTIF12:1;
      uint64_t TCIF12:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF12:1;
      uint64_t CCTCIF12:1;
      uint64_t CBRTIF12:1;
      uint64_t CBTIF12:1;
      uint64_t CLTCIF12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12TBR;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C12MDR;

  uint8_t res26[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF13:1;
      uint64_t CTCIF13:1;
      uint64_t BRTIF13:1;
      uint64_t BTIF13:1;
      uint64_t TCIF13:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF13:1;
      uint64_t CCTCIF13:1;
      uint64_t CBRTIF13:1;
      uint64_t CBTIF13:1;
      uint64_t CLTCIF13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13TBR;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMA_C13MDR;

