iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res21[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t WZL:1;
      uint64_t reservedSpace0:6;
      uint64_t TACC:8;
      uint64_t TRWR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HLCR;

};

#define OCTOSPI1 (*(volatile struct OCTOSPI1_tag *) 0x52005000)

struct OCTOSPI2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t ABORT:1;
      uint64_t DMAEN:1;
      uint64_t TCEN:1;
      uint64_t reservedSpace0:2;
      uint64_t DQM:1;
      uint64_t FSEL:1;
      uint64_t FTHRES:5;
      uint64_t reservedSpace1:3;
      uint64_t TEIE:1;
      uint64_t TCIE:1;
      uint64_t FTIE:1;
      uint64_t SMIE:1;
      uint64_t TOIE:1;
      uint64_t reservedSpace2:1;
      uint64_t APMS:1;
      uint64_t PMM:1;
      uint64_t reservedSpace3:4;
      uint64_t FMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKMODE:1;
      uint64_t FRCK:1;
      uint64_t reservedSpace0:6;
      uint64_t CSHT:3;
      uint64_t reservedSpace1:5;
      uint64_t DEVSIZE:5;
      uint64_t reservedSpace2:3;
      uint64_t MTYP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESCALER:8;
      uint64_t reservedSpace0:8;
      uint64_t WRAPSIZE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXTRAN:8;
      uint64_t reservedSpace0:8;
      uint64_t CSBOUND:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFRESH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR4;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEF:1;
      uint64_t CTCF:1;
      uint64_t FTF:1;
      uint64_t CSMF:1;
      uint64_t CTOF:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t FLEVEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEF:1;
      uint64_t CTCF:1;
      uint64_t reservedSpace0:1;
      uint64_t CSMF:1;
      uint64_t CTOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  uint8_t res5[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMKR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMAR;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTERVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIR;

  uint8_t res8[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMODE:3;
      uint64_t IDTR:1;
      uint64_t ISIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t ADMODE:3;
      uint64_t ADDTR:1;
      uint64_t ADSIZE:2;
      uint64_t reservedSpace1:2;
      uint64_t ABMODE:3;
      uint64_t ABDTR:1;
      uint64_t ABSIZE:2;
      uint64_t reservedSpace2:2;
      uint64_t DMODE:3;
      uint64_t DDTR:1;
      uint64_t reservedSpace3:1;
      uint64_t DQSE:1;
      uint64_t reservedSpace4:1;
      uint64_t SIOO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCYC:5;
      uint64_t reservedSpace0:23;
      uint64_t DHQC:1;
      uint64_t reservedSpace1:1;
      uint64_t SSHIFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRUCTION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTERNATE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ABR;

  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMEOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTR;

  uint8_t res13[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMODE:3;
      uint64_t IDTR:1;
      uint64_t ISIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t ADMODE:3;
      uint64_t ADDTR:1;
      uint64_t ADSIZE:2;
      uint64_t reservedSpace1:2;
      uint64_t ABMODE:3;
      uint64_t ABDTR:1;
      uint64_t ABSIZE:2;
      uint64_t reservedSpace2:2;
      uint64_t DMODE:3;
      uint64_t DDTR:1;
      uint64_t reservedSpace3:1;
      uint64_t DQSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPCCR;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCYC:5;
      uint64_t reservedSpace0:23;
      uint64_t DHQC:1;
      uint64_t reservedSpace1:1;
      uint64_t SSHIFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPTCR;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRUCTION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPIR;

  uint8_t res16[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTERNATE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPABR;

  uint8_t res17[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMODE:2;
      uint64_t IDTR:1;
      uint64_t ISIZE:1;
      uint64_t reservedSpace0:4;
      uint64_t ADMODE:3;
      uint64_t ADDTR:1;
      uint64_t ADSIZE:2;
      uint64_t reservedSpace1:2;
      uint64_t ABMODE:3;
      uint64_t ABDTR:1;
      uint64_t ABSIZE:2;
      uint64_t reservedSpace2:2;
      uint64_t DMODE:3;
      uint64_t DDTR:1;
      uint64_t reservedSpace3:1;
      uint64_t DQSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WCCR;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCYC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTCR;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRUCTION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIR;

  uint8_t res20[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTERNATE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WABR;

