iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSIZ:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSDEV:1;
      uint64_t EPTYP:2;
      uint64_t MC:2;
      uint64_t DAD:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTG_HS_HCCHAR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPLSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLITEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTG_HS_HCSPLT15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRC:1;
      uint64_t CHH:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t TXERR:1;
      uint64_t BBERR:1;
      uint64_t FRMOR:1;
      uint64_t DTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTG_HS_HCINT15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRCM:1;
      uint64_t CHHM:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAKM:1;
      uint64_t ACKM:1;
      uint64_t NYET:1;
      uint64_t TXERRM:1;
      uint64_t BBERRM:1;
      uint64_t FRMORM:1;
      uint64_t DTERRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTG_HS_HCINTMSK15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRSIZ:19;
      uint64_t PKTCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTG_HS_HCTSIZ15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTG_HS_HCDMA15;

};

#define OTG2_HS_HOST (*(volatile struct OTG2_HS_HOST_tag *) 0x40080400)

struct OTG1_HS_PWRCLK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STPPCLK:1;
      uint64_t GATEHCLK:1;
      uint64_t reservedSpace0:2;
      uint64_t PHYSUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTG_HS_PCGCR;

};

#define OTG1_HS_PWRCLK (*(volatile struct OTG1_HS_PWRCLK_tag *) 0x40040e00)

struct OTG2_HS_PWRCLK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STPPCLK:1;
      uint64_t GATEHCLK:1;
      uint64_t reservedSpace0:2;
      uint64_t PHYSUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTG_HS_PCGCR;

};

#define OTG2_HS_PWRCLK (*(volatile struct OTG2_HS_PWRCLK_tag *) 0x40080e00)

struct OctoSPII_O_Manager_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXEN:1;
      uint64_t reservedSpace0:15;
      uint64_t REQ2ACK_TIME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKEN:1;
      uint64_t CLKSRC:1;
      uint64_t reservedSpace0:2;
      uint64_t DQSEN:1;
      uint64_t DQSSRC:1;
      uint64_t reservedSpace1:2;
      uint64_t NCSEN:1;
      uint64_t NCSSRC:1;
      uint64_t reservedSpace2:6;
      uint64_t IOLEN:1;
      uint64_t IOLSRC:2;
      uint64_t reservedSpace3:5;
      uint64_t IOHEN:1;
      uint64_t IOHSRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKEN:1;
      uint64_t CLKSRC:1;
      uint64_t reservedSpace0:2;
      uint64_t DQSEN:1;
      uint64_t DQSSRC:1;
      uint64_t reservedSpace1:2;
      uint64_t NCSEN:1;
      uint64_t NCSSRC:1;
      uint64_t reservedSpace2:6;
      uint64_t IOLEN:1;
      uint64_t IOLSRC:2;
      uint64_t reservedSpace3:5;
      uint64_t IOHEN:1;
      uint64_t IOHSRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P2CR;

};

#define OctoSPII_O_Manager (*(volatile struct OctoSPII_O_Manager_tag *) 0x5200b400)

struct PF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CL1:3;
      uint64_t CL2:3;
      uint64_t CL3:3;
      uint64_t CL4:3;
      uint64_t CL5:3;
      uint64_t CL6:3;
      uint64_t CL7:3;
      uint64_t LoUIS:3;
      uint64_t LoC:3;
      uint64_t LoU:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t _IminLine:4;
      uint64_t reservedSpace0:12;
      uint64_t DMinLine:4;
      uint64_t ERG:4;
      uint64_t CWG:4;
      uint64_t reservedSpace1:1;
      uint64_t Format:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LineSize:3;
      uint64_t Associativity:10;
      uint64_t NumSets:15;
      uint64_t WA:1;
      uint64_t RA:1;
      uint64_t WB:1;
      uint64_t WT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCSIDR;

};

#define PF (*(volatile struct PF_tag *) 0xe000ed78)

struct PWR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPDS:1;
      uint64_t reservedSpace0:3;
      uint64_t PVDE:1;
      uint64_t PLS:3;
      uint64_t DBP:1;
      uint64_t FLPS:1;
      uint64_t reservedSpace1:4;
      uint64_t SVOS:2;
      uint64_t AVDEN:1;
      uint64_t ALS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PVDO:1;
      uint64_t reservedSpace1:8;
      uint64_t ACTVOSRDY:1;
      uint64_t ACTVOS:2;
      uint64_t AVDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BREN:1;
      uint64_t reservedSpace0:3;
      uint64_t MONEN:1;
      uint64_t reservedSpace1:11;
      uint64_t BRRDY:1;
      uint64_t reservedSpace2:3;
      uint64_t VBATL:1;
      uint64_t VBATH:1;
      uint64_t TEMPL:1;
      uint64_t TEMPH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t LDOEN:1;
      uint64_t SDEN:1;
      uint64_t reservedSpace0:5;
      uint64_t VBE:1;
      uint64_t VBRS:1;
      uint64_t reservedSpace1:14;
      uint64_t USB33DEN:1;
      uint64_t USBREGEN:1;
      uint64_t USB33RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDDS_D1:1;
      uint64_t PDDS_D2:1;
      uint64_t PDDS_D3:1;
      uint64_t reservedSpace0:2;
      uint64_t STOPF:1;
      uint64_t SBF:1;
      uint64_t SBF_D1:1;
      uint64_t SBF_D2:1;
      uint64_t CSSF:1;
      uint64_t reservedSpace1:1;
      uint64_t RUN_D3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUCR;

