iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t VOSRDY:1;
      uint64_t VOS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3CR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPF1:1;
      uint64_t WKUPF2:1;
      uint64_t WKUPF3:1;
      uint64_t WKUPF4:1;
      uint64_t WKUPF5:1;
      uint64_t WKUPF6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUPFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPEN1:1;
      uint64_t WKUPEN2:1;
      uint64_t WKUPEN3:1;
      uint64_t WKUPEN4:1;
      uint64_t WKUPEN5:1;
      uint64_t WKUPEN6:1;
      uint64_t reservedSpace0:2;
      uint64_t WKUPP1:1;
      uint64_t WKUPP2:1;
      uint64_t WKUPP3:1;
      uint64_t WKUPP4:1;
      uint64_t WKUPP5:1;
      uint64_t WKUPP6:1;
      uint64_t reservedSpace1:2;
      uint64_t WKUPPUPD1:2;
      uint64_t WKUPPUPD2:2;
      uint64_t WKUPPUPD3:2;
      uint64_t WKUPPUPD4:2;
      uint64_t WKUPPUPD5:2;
      uint64_t WKUPPUPD6:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUPEPR;

};

#define PWR (*(volatile struct PWR_tag *) 0x58024800)

struct RAMECC3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIE:1;
      uint64_t GECCSEIE:1;
      uint64_t GECCDEIE:1;
      uint64_t GECCDEBWIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ECCSEIE:1;
      uint64_t ECCDEIE:1;
      uint64_t ECCDEBWIE:1;
      uint64_t ECCELEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEDCF:1;
      uint64_t DEDF:1;
      uint64_t DEBWDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M1SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M1FAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDATAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M1FDRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDATAH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M1FDRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M1FECR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ECCSEIE:1;
      uint64_t ECCDEIE:1;
      uint64_t ECCDEBWIE:1;
      uint64_t ECCELEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEDCF:1;
      uint64_t DEDF:1;
      uint64_t DEBWDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M2SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M2FAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDATAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M2FDRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDATAH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M2FDRH;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M2FECR;

};

#define RAMECC3 (*(volatile struct RAMECC3_tag *) 0x58027000)

struct RCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSION:1;
      uint64_t HSIKERON:1;
      uint64_t HSIRDY:1;
      uint64_t HSIDIV:2;
      uint64_t HSIDIVF:1;
      uint64_t reservedSpace0:1;
      uint64_t CSION:1;
      uint64_t CSIRDY:1;
      uint64_t CSIKERON:1;
      uint64_t reservedSpace1:2;
      uint64_t RC48ON:1;
      uint64_t RC48RDY:1;
      uint64_t D1CKRDY:1;
      uint64_t D2CKRDY:1;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t HSECSSON:1;
      uint64_t reservedSpace2:4;
      uint64_t PLL1ON:1;
      uint64_t PLL1RDY:1;
      uint64_t PLL2ON:1;
      uint64_t PLL2RDY:1;
      uint64_t PLL3ON:1;
      uint64_t PLL3RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSICAL:12;
      uint64_t HSITRIM:6;
      uint64_t CSICAL:8;
      uint64_t CSITRIM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RC48CAL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRRCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:3;
      uint64_t SWS:3;
      uint64_t STOPWUCK:1;
      uint64_t STOPKERWUCK:1;
      uint64_t RTCPRE:6;
      uint64_t HRTIMSEL:1;
      uint64_t TIMPRE:1;
      uint64_t reservedSpace0:2;
      uint64_t MCO1PRE:4;
      uint64_t MCO1SEL:3;
      uint64_t MCO2PRE:4;
      uint64_t MCO2SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPRE:4;
      uint64_t D1PPRE:3;
      uint64_t reservedSpace0:1;
      uint64_t D1CPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D1CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t D2PPRE1:3;
      uint64_t reservedSpace1:1;
      uint64_t D2PPRE2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D2CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t D3PPRE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3CFGR;

