iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDMAAMEN:1;
      uint64_t reservedSpace0:2;
      uint64_t LPUART1AMEN:1;
      uint64_t reservedSpace1:1;
      uint64_t SPI6AMEN:1;
      uint64_t reservedSpace2:1;
      uint64_t I2C4AMEN:1;
      uint64_t reservedSpace3:1;
      uint64_t LPTIM2AMEN:1;
      uint64_t LPTIM3AMEN:1;
      uint64_t LPTIM4AMEN:1;
      uint64_t LPTIM5AMEN:1;
      uint64_t reservedSpace4:1;
      uint64_t COMP12AMEN:1;
      uint64_t VREFAMEN:1;
      uint64_t RTCAMEN:1;
      uint64_t reservedSpace5:2;
      uint64_t CRCAMEN:1;
      uint64_t reservedSpace6:1;
      uint64_t SAI4AMEN:1;
      uint64_t reservedSpace7:2;
      uint64_t ADC3AMEN:1;
      uint64_t reservedSpace8:3;
      uint64_t BKPSRAMAMEN:1;
      uint64_t SRAM4AMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3AMR;

  uint8_t res8[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RMVF:1;
      uint64_t CPURSTF:1;
      uint64_t reservedSpace1:1;
      uint64_t D1RSTF:1;
      uint64_t D2RSTF:1;
      uint64_t BORRSTF:1;
      uint64_t PINRSTF:1;
      uint64_t PORRSTF:1;
      uint64_t SFTRSTF:1;
      uint64_t reservedSpace2:1;
      uint64_t IWDG1RSTF:1;
      uint64_t reservedSpace3:1;
      uint64_t WWDG1RSTF:1;
      uint64_t reservedSpace4:1;
      uint64_t LPWRRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDMAEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DMA2DEN:1;
      uint64_t JPGDECEN:1;
      uint64_t reservedSpace1:6;
      uint64_t FMCEN:1;
      uint64_t reservedSpace2:1;
      uint64_t QSPIEN:1;
      uint64_t reservedSpace3:1;
      uint64_t SDMMC1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1EN:1;
      uint64_t DMA2EN:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC12EN:1;
      uint64_t reservedSpace1:9;
      uint64_t ETH1MACEN:1;
      uint64_t ETH1TXEN:1;
      uint64_t ETH1RXEN:1;
      uint64_t reservedSpace2:7;
      uint64_t USB1OTGEN:1;
      uint64_t USB1ULPIEN:1;
      uint64_t USB2OTGEN:1;
      uint64_t USB2ULPIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAMITFEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRYPTEN:1;
      uint64_t HASHEN:1;
      uint64_t RNGEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SDMMC2EN:1;
      uint64_t reservedSpace2:19;
      uint64_t SRAM1EN:1;
      uint64_t SRAM2EN:1;
      uint64_t SRAM3EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOAEN:1;
      uint64_t GPIOBEN:1;
      uint64_t GPIOCEN:1;
      uint64_t GPIODEN:1;
      uint64_t GPIOEEN:1;
      uint64_t GPIOFEN:1;
      uint64_t GPIOGEN:1;
      uint64_t GPIOHEN:1;
      uint64_t GPIOIEN:1;
      uint64_t GPIOJEN:1;
      uint64_t GPIOKEN:1;
      uint64_t reservedSpace0:8;
      uint64_t CRCEN:1;
      uint64_t reservedSpace1:1;
      uint64_t BDMAEN:1;
      uint64_t reservedSpace2:2;
      uint64_t ADC3EN:1;
      uint64_t HSEMEN:1;
      uint64_t reservedSpace3:2;
      uint64_t BKPRAMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB4ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LTDCEN:1;
      uint64_t reservedSpace1:2;
      uint64_t WWDG1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB3ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t TIM3EN:1;
      uint64_t TIM4EN:1;
      uint64_t TIM5EN:1;
      uint64_t TIM6EN:1;
      uint64_t TIM7EN:1;
      uint64_t TIM12EN:1;
      uint64_t TIM13EN:1;
      uint64_t TIM14EN:1;
      uint64_t LPTIM1EN:1;
      uint64_t reservedSpace0:4;
      uint64_t SPI2EN:1;
      uint64_t SPI3EN:1;
      uint64_t SPDIFRXEN:1;
      uint64_t USART2EN:1;
      uint64_t USART3EN:1;
      uint64_t UART4EN:1;
      uint64_t UART5EN:1;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t I2C3EN:1;
      uint64_t reservedSpace1:3;
      uint64_t HDMICECEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DAC12EN:1;
      uint64_t USART7EN:1;
      uint64_t USART8EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1LENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CRSEN:1;
      uint64_t SWPEN:1;
      uint64_t reservedSpace1:1;
      uint64_t OPAMPEN:1;
      uint64_t MDIOSEN:1;
      uint64_t reservedSpace2:2;
      uint64_t FDCANEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1HENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1EN:1;
      uint64_t TIM8EN:1;
      uint64_t reservedSpace0:2;
      uint64_t USART1EN:1;
      uint64_t USART6EN:1;
      uint64_t reservedSpace1:6;
      uint64_t SPI1EN:1;
      uint64_t SPI4EN:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM15EN:1;
      uint64_t TIM16EN:1;
      uint64_t TIM17EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SPI5EN:1;
      uint64_t reservedSpace4:1;
      uint64_t SAI1EN:1;
      uint64_t SAI2EN:1;
      uint64_t SAI3EN:1;
      uint64_t reservedSpace5:3;
      uint64_t DFSDM1EN:1;
      uint64_t HRTIMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace1:1;
      uint64_t LPUART1EN:1;
      uint64_t reservedSpace2:1;
      uint64_t SPI6EN:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C4EN:1;
      uint64_t reservedSpace4:1;
      uint64_t LPTIM2EN:1;
      uint64_t LPTIM3EN:1;
      uint64_t LPTIM4EN:1;
      uint64_t LPTIM5EN:1;
      uint64_t reservedSpace5:1;
      uint64_t COMP12EN:1;
      uint64_t VREFEN:1;
      uint64_t RTCAPBEN:1;
      uint64_t reservedSpace6:4;
      uint64_t SAI4EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB4ENR;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDMALPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DMA2DLPEN:1;
      uint64_t JPGDECLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t FLITFLPEN:1;
      uint64_t reservedSpace2:3;
      uint64_t FMCLPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t QSPILPEN:1;
      uint64_t reservedSpace4:1;
      uint64_t SDMMC1LPEN:1;
      uint64_t reservedSpace5:11;
      uint64_t D1DTCM1LPEN:1;
      uint64_t DTCM2LPEN:1;
      uint64_t ITCMLPEN:1;
      uint64_t AXISRAMLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1LPEN:1;
      uint64_t DMA2LPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC12LPEN:1;
      uint64_t reservedSpace1:9;
      uint64_t ETH1MACLPEN:1;
      uint64_t ETH1TXLPEN:1;
      uint64_t ETH1RXLPEN:1;
      uint64_t reservedSpace2:7;
      uint64_t USB1OTGLPEN:1;
      uint64_t USB1ULPILPEN:1;
      uint64_t USB2OTGLPEN:1;
      uint64_t USB2ULPILPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAMITFLPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRYPTLPEN:1;
      uint64_t HASHLPEN:1;
      uint64_t RNGLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SDMMC2LPEN:1;
      uint64_t reservedSpace2:19;
      uint64_t SRAM1LPEN:1;
      uint64_t SRAM2LPEN:1;
      uint64_t SRAM3LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOALPEN:1;
      uint64_t GPIOBLPEN:1;
      uint64_t GPIOCLPEN:1;
      uint64_t GPIODLPEN:1;
      uint64_t GPIOELPEN:1;
      uint64_t GPIOFLPEN:1;
      uint64_t GPIOGLPEN:1;
      uint64_t GPIOHLPEN:1;
      uint64_t GPIOILPEN:1;
      uint64_t GPIOJLPEN:1;
      uint64_t GPIOKLPEN:1;
      uint64_t reservedSpace0:8;
      uint64_t CRCLPEN:1;
      uint64_t reservedSpace1:1;
      uint64_t BDMALPEN:1;
      uint64_t reservedSpace2:2;
      uint64_t ADC3LPEN:1;
      uint64_t reservedSpace3:3;
      uint64_t BKPRAMLPEN:1;
      uint64_t SRAM4LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB4LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LTDCLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t WWDG1LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB3LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2LPEN:1;
      uint64_t TIM3LPEN:1;
      uint64_t TIM4LPEN:1;
      uint64_t TIM5LPEN:1;
      uint64_t TIM6LPEN:1;
      uint64_t TIM7LPEN:1;
      uint64_t TIM12LPEN:1;
      uint64_t TIM13LPEN:1;
      uint64_t TIM14LPEN:1;
      uint64_t LPTIM1LPEN:1;
      uint64_t reservedSpace0:4;
      uint64_t SPI2LPEN:1;
      uint64_t SPI3LPEN:1;
      uint64_t SPDIFRXLPEN:1;
      uint64_t USART2LPEN:1;
      uint64_t USART3LPEN:1;
      uint64_t UART4LPEN:1;
      uint64_t UART5LPEN:1;
      uint64_t I2C1LPEN:1;
      uint64_t I2C2LPEN:1;
      uint64_t I2C3LPEN:1;
      uint64_t reservedSpace1:3;
      uint64_t HDMICECLPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DAC12LPEN:1;
      uint64_t USART7LPEN:1;
      uint64_t USART8LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1LLPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CRSLPEN:1;
      uint64_t SWPLPEN:1;
      uint64_t reservedSpace1:1;
      uint64_t OPAMPLPEN:1;
      uint64_t MDIOSLPEN:1;
      uint64_t reservedSpace2:2;
      uint64_t FDCANLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1HLPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1LPEN:1;
      uint64_t TIM8LPEN:1;
      uint64_t reservedSpace0:2;
      uint64_t USART1LPEN:1;
      uint64_t USART6LPEN:1;
      uint64_t reservedSpace1:6;
      uint64_t SPI1LPEN:1;
      uint64_t SPI4LPEN:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM15LPEN:1;
      uint64_t TIM16LPEN:1;
      uint64_t TIM17LPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t SPI5LPEN:1;
      uint64_t reservedSpace4:1;
      uint64_t SAI1LPEN:1;
      uint64_t SAI2LPEN:1;
      uint64_t SAI3LPEN:1;
      uint64_t reservedSpace5:3;
      uint64_t DFSDM1LPEN:1;
      uint64_t HRTIMLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSCFGLPEN:1;
      uint64_t reservedSpace1:1;
      uint64_t LPUART1LPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t SPI6LPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C4LPEN:1;
      uint64_t reservedSpace4:1;
      uint64_t LPTIM2LPEN:1;
      uint64_t LPTIM3LPEN:1;
      uint64_t LPTIM4LPEN:1;
      uint64_t LPTIM5LPEN:1;
      uint64_t reservedSpace5:1;
      uint64_t COMP12LPEN:1;
      uint64_t VREFLPEN:1;
      uint64_t RTCAPBLPEN:1;
      uint64_t reservedSpace6:4;
      uint64_t SAI4LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB4LPENR;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RMVF:1;
      uint64_t CPURSTF:1;
      uint64_t reservedSpace1:1;
      uint64_t D1RSTF:1;
      uint64_t D2RSTF:1;
      uint64_t BORRSTF:1;
      uint64_t PINRSTF:1;
      uint64_t PORRSTF:1;
      uint64_t SFTRSTF:1;
      uint64_t reservedSpace2:1;
      uint64_t IWDG1RSTF:1;
      uint64_t reservedSpace3:1;
      uint64_t WWDG1RSTF:1;
      uint64_t reservedSpace4:1;
      uint64_t LPWRRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_RSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDMAEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DMA2DEN:1;
      uint64_t JPGDECEN:1;
      uint64_t reservedSpace1:6;
      uint64_t FMCEN:1;
      uint64_t reservedSpace2:1;
      uint64_t QSPIEN:1;
      uint64_t reservedSpace3:1;
      uint64_t SDMMC1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_AHB3ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1EN:1;
      uint64_t DMA2EN:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC12EN:1;
      uint64_t reservedSpace1:9;
      uint64_t ETH1MACEN:1;
      uint64_t ETH1TXEN:1;
      uint64_t ETH1RXEN:1;
      uint64_t reservedSpace2:7;
      uint64_t USB1OTGEN:1;
      uint64_t USB1ULPIEN:1;
      uint64_t USB2OTGEN:1;
      uint64_t USB2ULPIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_AHB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAMITFEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRYPTEN:1;
      uint64_t HASHEN:1;
      uint64_t RNGEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SDMMC2EN:1;
      uint64_t reservedSpace2:19;
      uint64_t SRAM1EN:1;
      uint64_t SRAM2EN:1;
      uint64_t SRAM3EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_AHB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOAEN:1;
      uint64_t GPIOBEN:1;
      uint64_t GPIOCEN:1;
      uint64_t GPIODEN:1;
      uint64_t GPIOEEN:1;
      uint64_t GPIOFEN:1;
      uint64_t GPIOGEN:1;
      uint64_t GPIOHEN:1;
      uint64_t GPIOIEN:1;
      uint64_t GPIOJEN:1;
      uint64_t GPIOKEN:1;
      uint64_t reservedSpace0:8;
      uint64_t CRCEN:1;
      uint64_t reservedSpace1:1;
      uint64_t BDMAEN:1;
      uint64_t reservedSpace2:2;
      uint64_t ADC3EN:1;
      uint64_t HSEMEN:1;
      uint64_t reservedSpace3:2;
      uint64_t BKPRAMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_AHB4ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LTDCEN:1;
      uint64_t reservedSpace1:2;
      uint64_t WWDG1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB3ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t TIM3EN:1;
      uint64_t TIM4EN:1;
      uint64_t TIM5EN:1;
      uint64_t TIM6EN:1;
      uint64_t TIM7EN:1;
      uint64_t TIM12EN:1;
      uint64_t TIM13EN:1;
      uint64_t TIM14EN:1;
      uint64_t LPTIM1EN:1;
      uint64_t reservedSpace0:4;
      uint64_t SPI2EN:1;
      uint64_t SPI3EN:1;
      uint64_t SPDIFRXEN:1;
      uint64_t USART2EN:1;
      uint64_t USART3EN:1;
      uint64_t UART4EN:1;
      uint64_t UART5EN:1;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t I2C3EN:1;
      uint64_t reservedSpace1:3;
      uint64_t HDMICECEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DAC12EN:1;
      uint64_t USART7EN:1;
      uint64_t USART8EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB1LENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CRSEN:1;
      uint64_t SWPEN:1;
      uint64_t reservedSpace1:1;
      uint64_t OPAMPEN:1;
      uint64_t MDIOSEN:1;
      uint64_t reservedSpace2:2;
      uint64_t FDCANEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB1HENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1EN:1;
      uint64_t TIM8EN:1;
      uint64_t reservedSpace0:2;
      uint64_t USART1EN:1;
      uint64_t USART6EN:1;
      uint64_t reservedSpace1:6;
      uint64_t SPI1EN:1;
      uint64_t SPI4EN:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM15EN:1;
      uint64_t TIM16EN:1;
      uint64_t TIM17EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SPI5EN:1;
      uint64_t reservedSpace4:1;
      uint64_t SAI1EN:1;
      uint64_t SAI2EN:1;
      uint64_t SAI3EN:1;
      uint64_t reservedSpace5:3;
      uint64_t DFSDM1EN:1;
      uint64_t HRTIMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace1:1;
      uint64_t LPUART1EN:1;
      uint64_t reservedSpace2:1;
      uint64_t SPI6EN:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C4EN:1;
      uint64_t reservedSpace4:1;
      uint64_t LPTIM2EN:1;
      uint64_t LPTIM3EN:1;
      uint64_t LPTIM4EN:1;
      uint64_t LPTIM5EN:1;
      uint64_t reservedSpace5:1;
      uint64_t COMP12EN:1;
      uint64_t VREFEN:1;
      uint64_t RTCAPBEN:1;
      uint64_t reservedSpace6:4;
      uint64_t SAI4EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB4ENR;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDMALPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DMA2DLPEN:1;
      uint64_t JPGDECLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t FLITFLPEN:1;
      uint64_t reservedSpace2:3;
      uint64_t FMCLPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t QSPILPEN:1;
      uint64_t reservedSpace4:1;
      uint64_t SDMMC1LPEN:1;
      uint64_t reservedSpace5:11;
      uint64_t D1DTCM1LPEN:1;
      uint64_t DTCM2LPEN:1;
      uint64_t ITCMLPEN:1;
      uint64_t AXISRAMLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_AHB3LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1LPEN:1;
      uint64_t DMA2LPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC12LPEN:1;
      uint64_t reservedSpace1:9;
      uint64_t ETH1MACLPEN:1;
      uint64_t ETH1TXLPEN:1;
      uint64_t ETH1RXLPEN:1;
      uint64_t reservedSpace2:7;
      uint64_t USB1OTGLPEN:1;
      uint64_t USB1ULPILPEN:1;
      uint64_t USB2OTGLPEN:1;
      uint64_t USB2ULPILPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_AHB1LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAMITFLPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRYPTLPEN:1;
      uint64_t HASHLPEN:1;
      uint64_t RNGLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SDMMC2LPEN:1;
      uint64_t reservedSpace2:19;
      uint64_t SRAM1LPEN:1;
      uint64_t SRAM2LPEN:1;
      uint64_t SRAM3LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_AHB2LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOALPEN:1;
      uint64_t GPIOBLPEN:1;
      uint64_t GPIOCLPEN:1;
      uint64_t GPIODLPEN:1;
      uint64_t GPIOELPEN:1;
      uint64_t GPIOFLPEN:1;
      uint64_t GPIOGLPEN:1;
      uint64_t GPIOHLPEN:1;
      uint64_t GPIOILPEN:1;
      uint64_t GPIOJLPEN:1;
      uint64_t GPIOKLPEN:1;
      uint64_t reservedSpace0:8;
      uint64_t CRCLPEN:1;
      uint64_t reservedSpace1:1;
      uint64_t BDMALPEN:1;
      uint64_t reservedSpace2:2;
      uint64_t ADC3LPEN:1;
      uint64_t reservedSpace3:3;
      uint64_t BKPRAMLPEN:1;
      uint64_t SRAM4LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_AHB4LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LTDCLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t WWDG1LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB3LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2LPEN:1;
      uint64_t TIM3LPEN:1;
      uint64_t TIM4LPEN:1;
      uint64_t TIM5LPEN:1;
      uint64_t TIM6LPEN:1;
      uint64_t TIM7LPEN:1;
      uint64_t TIM12LPEN:1;
      uint64_t TIM13LPEN:1;
      uint64_t TIM14LPEN:1;
      uint64_t LPTIM1LPEN:1;
      uint64_t reservedSpace0:4;
      uint64_t SPI2LPEN:1;
      uint64_t SPI3LPEN:1;
      uint64_t SPDIFRXLPEN:1;
      uint64_t USART2LPEN:1;
      uint64_t USART3LPEN:1;
      uint64_t UART4LPEN:1;
      uint64_t UART5LPEN:1;
      uint64_t I2C1LPEN:1;
      uint64_t I2C2LPEN:1;
      uint64_t I2C3LPEN:1;
      uint64_t reservedSpace1:3;
      uint64_t HDMICECLPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DAC12LPEN:1;
      uint64_t USART7LPEN:1;
      uint64_t USART8LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB1LLPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CRSLPEN:1;
      uint64_t SWPLPEN:1;
      uint64_t reservedSpace1:1;
      uint64_t OPAMPLPEN:1;
      uint64_t MDIOSLPEN:1;
      uint64_t reservedSpace2:2;
      uint64_t FDCANLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB1HLPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1LPEN:1;
      uint64_t TIM8LPEN:1;
      uint64_t reservedSpace0:2;
      uint64_t USART1LPEN:1;
      uint64_t USART6LPEN:1;
      uint64_t reservedSpace1:6;
      uint64_t SPI1LPEN:1;
      uint64_t SPI4LPEN:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM15LPEN:1;
      uint64_t TIM16LPEN:1;
      uint64_t TIM17LPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t SPI5LPEN:1;
      uint64_t reservedSpace4:1;
      uint64_t SAI1LPEN:1;
      uint64_t SAI2LPEN:1;
      uint64_t SAI3LPEN:1;
      uint64_t reservedSpace5:3;
      uint64_t DFSDM1LPEN:1;
      uint64_t HRTIMLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB2LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSCFGLPEN:1;
      uint64_t reservedSpace1:1;
      uint64_t LPUART1LPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t SPI6LPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C4LPEN:1;
      uint64_t reservedSpace4:1;
      uint64_t LPTIM2LPEN:1;
      uint64_t LPTIM3LPEN:1;
      uint64_t LPTIM4LPEN:1;
      uint64_t LPTIM5LPEN:1;
      uint64_t reservedSpace5:1;
      uint64_t COMP12LPEN:1;
      uint64_t VREFLPEN:1;
      uint64_t RTCAPBLPEN:1;
      uint64_t reservedSpace6:4;
      uint64_t SAI4LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1_APB4LPENR;

