iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
};

#define SDMMC2 (*(volatile struct SDMMC2_tag *) 0x48022400)

struct SPDIFRX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPDIFRXEN:2;
      uint64_t RXDMAEN:1;
      uint64_t RXSTEO:1;
      uint64_t DRFMT:2;
      uint64_t PMSK:1;
      uint64_t VMSK:1;
      uint64_t CUMSK:1;
      uint64_t PTMSK:1;
      uint64_t CBDMAEN:1;
      uint64_t CHSEL:1;
      uint64_t NBTR:2;
      uint64_t WFA:1;
      uint64_t reservedSpace0:1;
      uint64_t INSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t CKSEN:1;
      uint64_t CKSBKPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNEIE:1;
      uint64_t CSRNEIE:1;
      uint64_t PERRIE:1;
      uint64_t OVRIE:1;
      uint64_t SBLKIE:1;
      uint64_t SYNCDIE:1;
      uint64_t IFEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNE:1;
      uint64_t CSRNE:1;
      uint64_t PERR:1;
      uint64_t OVR:1;
      uint64_t SBD:1;
      uint64_t SYNCD:1;
      uint64_t FERR:1;
      uint64_t SERR:1;
      uint64_t TERR:1;
      uint64_t reservedSpace0:7;
      uint64_t WIDTH5:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PERRCF:1;
      uint64_t OVRCF:1;
      uint64_t SBDCF:1;
      uint64_t SYNCDCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR:24;
      uint64_t PE:1;
      uint64_t V:1;
      uint64_t U:1;
      uint64_t C:1;
      uint64_t PT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMT0_DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USR:16;
      uint64_t CS:8;
      uint64_t SOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THI:13;
      uint64_t reservedSpace0:3;
      uint64_t TLO:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR;

};

#define SPDIFRX (*(volatile struct SPDIFRX_tag *) 0x40004000)

struct SPI1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPE:1;
      uint64_t reservedSpace0:7;
      uint64_t MASRX:1;
      uint64_t CSTART:1;
      uint64_t CSUSP:1;
      uint64_t HDDIR:1;
      uint64_t SSI:1;
      uint64_t CRC33_17:1;
      uint64_t RCRCI:1;
      uint64_t TCRCI:1;
      uint64_t IOLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSIZE:16;
      uint64_t TSER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSIZE:5;
      uint64_t FTHVL:4;
      uint64_t UDRCFG:2;
      uint64_t UDRDET:2;
      uint64_t reservedSpace0:1;
      uint64_t RXDMAEN:1;
      uint64_t TXDMAEN:1;
      uint64_t CRCSIZE:5;
      uint64_t reservedSpace1:1;
      uint64_t CRCEN:1;
      uint64_t reservedSpace2:5;
      uint64_t MBR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSSI:4;
      uint64_t MIDI:4;
      uint64_t reservedSpace0:7;
      uint64_t IOSWP:1;
      uint64_t reservedSpace1:1;
      uint64_t COMM:2;
      uint64_t SP:3;
      uint64_t MASTER:1;
      uint64_t LSBFRST:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t SSM:1;
      uint64_t reservedSpace2:1;
      uint64_t SSIOP:1;
      uint64_t SSOE:1;
      uint64_t SSOM:1;
      uint64_t AFCNTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPIE:1;
      uint64_t TXPIE:1;
      uint64_t DPXPIE:1;
      uint64_t EOTIE:1;
      uint64_t TXTFIE:1;
      uint64_t UDRIE:1;
      uint64_t OVRIE:1;
      uint64_t CRCEIE:1;
      uint64_t TIFREIE:1;
      uint64_t MODFIE:1;
      uint64_t TSERFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXP:1;
      uint64_t TXP:1;
      uint64_t DXP:1;
      uint64_t EOT:1;
      uint64_t TXTF:1;
      uint64_t UDR:1;
      uint64_t OVR:1;
      uint64_t CRCE:1;
      uint64_t TIFRE:1;
      uint64_t MODF:1;
      uint64_t TSERF:1;
      uint64_t SUSP:1;
      uint64_t TXC:1;
      uint64_t RXPLVL:2;
      uint64_t RXWNE:1;
      uint64_t CTSIZE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t EOTC:1;
      uint64_t TXTFC:1;
      uint64_t UDRC:1;
      uint64_t OVRC:1;
      uint64_t CRCEC:1;
      uint64_t TIFREC:1;
      uint64_t MODFC:1;
      uint64_t TSERFC:1;
      uint64_t SUSPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDR;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCPOLY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCPOLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDRDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDRDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SMOD:1;
      uint64_t I2SCFG:3;
      uint64_t I2SSTD:2;
      uint64_t reservedSpace0:1;
      uint64_t PCMSYNC:1;
      uint64_t DATLEN:2;
      uint64_t CHLEN:1;
      uint64_t CKPOL:1;
      uint64_t FIXCH:1;
      uint64_t WSINV:1;
      uint64_t DATFMT:1;
      uint64_t reservedSpace1:1;
      uint64_t I2SDIV:8;
      uint64_t ODD:1;
      uint64_t MCKOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCFGR;

