iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H723/targetInit/stm32h723_sfr.h
};

#define STK (*(volatile struct STK_tag *) 0xe000e010)

struct SWPMI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMA:1;
      uint64_t TXDMA:1;
      uint64_t RXMODE:1;
      uint64_t TXMODE:1;
      uint64_t LPBK:1;
      uint64_t SWPACT:1;
      uint64_t reservedSpace0:4;
      uint64_t DEACT:1;
      uint64_t SWPTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBFF:1;
      uint64_t TXBEF:1;
      uint64_t RXBERF:1;
      uint64_t RXOVRF:1;
      uint64_t TXUNRF:1;
      uint64_t RXNE:1;
      uint64_t TXE:1;
      uint64_t TCF:1;
      uint64_t SRF:1;
      uint64_t SUSP:1;
      uint64_t DEACTF:1;
      uint64_t RDYF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRXBFF:1;
      uint64_t CTXBEF:1;
      uint64_t CRXBERF:1;
      uint64_t CRXOVRF:1;
      uint64_t CTXUNRF:1;
      uint64_t reservedSpace0:2;
      uint64_t CTCF:1;
      uint64_t CSRF:1;
      uint64_t reservedSpace1:2;
      uint64_t CRDYF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBFIE:1;
      uint64_t TXBEIE:1;
      uint64_t RXBERIE:1;
      uint64_t RXOVRIE:1;
      uint64_t TXUNRIE:1;
      uint64_t RIE:1;
      uint64_t TIE:1;
      uint64_t TCIE:1;
      uint64_t SRIE:1;
      uint64_t reservedSpace0:2;
      uint64_t RDYIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWP_TBYP:1;
      uint64_t SWP_CLASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OR;

};

#define SWPMI (*(volatile struct SWPMI_tag *) 0x40008800)

struct SYSCFG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C1FMP:1;
      uint64_t I2C2FMP:1;
      uint64_t I2C3FMP:1;
      uint64_t I2C4FMP:1;
      uint64_t PB6FMP:1;
      uint64_t PB7FMP:1;
      uint64_t PB8FMP:1;
      uint64_t PB9FMP:1;
      uint64_t BOOSTE:1;
      uint64_t reservedSpace0:12;
      uint64_t EPIS:3;
      uint64_t PA0SO:1;
      uint64_t PA1SO:1;
      uint64_t PC2SO:1;
      uint64_t PC3SO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI0:4;
      uint64_t EXTI1:4;
      uint64_t EXTI2:4;
      uint64_t EXTI3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI4:4;
      uint64_t EXTI5:4;
      uint64_t EXTI6:4;
      uint64_t EXTI7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI8:4;
      uint64_t EXTI9:4;
      uint64_t EXTI10:4;
      uint64_t EXTI11:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI12:4;
      uint64_t EXTI13:4;
      uint64_t EXTI14:4;
      uint64_t EXTI15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR4;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t CS:1;
      uint64_t reservedSpace0:6;
      uint64_t READY:1;
      uint64_t reservedSpace1:7;
      uint64_t HSLV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCV:4;
      uint64_t PCV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCC:4;
      uint64_t PCC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCCR;

  uint8_t res1[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKGR;

  uint8_t res2[472];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKS:1;
      uint64_t reservedSpace0:15;
      uint64_t RDP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BORH:2;
      uint64_t reservedSpace0:14;
      uint64_t BOOT_ADD0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t BOOT_ADD1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MEPAD_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MESAD_1:1;
      uint64_t reservedSpace0:15;
      uint64_t WRPN_1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_BEG_1:12;
      uint64_t reservedSpace0:4;
      uint64_t PA_END_1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SA_BEG_1:12;
      uint64_t reservedSpace0:4;
      uint64_t SA_END_1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEPAD_2:1;
      uint64_t reservedSpace0:15;
      uint64_t MESAD_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRPN_2:8;
      uint64_t reservedSpace0:8;
      uint64_t PA_BEG_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_END_2:12;
      uint64_t reservedSpace0:4;
      uint64_t SA_BEG_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SA_END_2:12;
      uint64_t reservedSpace0:4;
      uint64_t IWDG1M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SECURE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDRS:2;
      uint64_t reservedSpace0:14;
      uint64_t D1SBRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D1STPRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t FZIWDGSTB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FZIWDGSTP:1;
      uint64_t reservedSpace0:15;
      uint64_t PKP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO_HSLV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR17;

